{"pages":[],"posts":[{"title":"欢迎来到Astroblog！","text":"渊源本人2019年4月在华为云购买了一台云服务器。本来打算是为了给自己“未来要做的“微信小程序提供后端服务的，但是后来没有再继续做小程序。为了将服务器继续利用起来，便有了这个博客。 简介Astroblog是我个人的技术总结与备忘，其中可能包括以下内容： 课程学习总结 与计算机技术相关的总结，比如一些教程或方法等，用作备忘 模拟飞行与民航知识，音乐知识，天文摄影后期技术总结 个人摄影作品以及其他优秀摄影作品的展览 其他内容 关于Astrobear站长现在（2021年8月）是一个研究僧，专业是航空宇航，从小喜欢航空与音乐，高中时开始喜欢天文，大学后开始学习计算机技术与应用。 由于我并不是计算机专业的，所以关于计算机技术这一块是本着“拿来主义”的态度去学的——会用就行。因此博客中与计算机技术相关的内容难免会有疏漏错误之处，也请大家海涵。 多亏有了互联网的发展，知识的传播可以如此地迅速。在此，对之前对我有过帮助的网友表示衷心的感谢！","link":"/2020/01/03/About/"},{"title":"Gallery","text":"Photos will continue to update…","link":"/2020/01/03/Gallery/"},{"title":"APIs of Multirotor in Airsim","text":"APIs of Multirotor in Airsimby Astrobear Preface All APIs listed below need to add the suffix .join(). Actually, .join() is a call on Python’s main process to wait for the thread to complete. All APIs listed below has a hidden parameter, which is vehicle_name. If you have more than one vehicle in the environment, please indicate the name of the vehicle that need to be operated clearly. This documention is still not very completed. If you have any advice or if you find any mistake, just comment at the end of the article. Control APIstakeoffAsync(timeout_sec): the multirotor will take off when this command is being executed. timeout_sec: take off time, second. Better to greater than 3s but less than 10s. hoverAsync(): the multirotor will maintain its attitude when executed. landAsync(timeout_sec): the multirotor will land when executed. timeout_sec: landing time, second. The default setting is 60s. If the altitude of the multirotor is too high, it may lose control and crash after the landing process lasting for more than 60s. It is recommended that you should make the multirotor descend to a reasonable altitude before starting the landing process. goHomeAsync(timeout_sec): the multirotor will fly back to its starting point automatically. timeout_sec: travel time, seconds. This process will end when the travel time is beyond the value whether the multirotor has reached the destination or not. The value of default setting is extremely big, thus we can let this parameter empty. moveByAngleZAsync(pitch, roll, z, yaw, duration): change the attitude of the multirotor and than change its movement. pitch: angle of pitch, radian. roll: angle of roll, radian. z: flight altitude, meter. Due to the NED coordinate system used in AirSim, the negative number means the positive altitude above the ground in reality. Similarity hereinafter. yaw: angle of yaw, radian. duration: the time for the multirotor to keep the given attitude, second. If there are no commands after duration time, the multirotor will maintain its previous given attitude and keep moving. You can use this API once again to set the multirotor to a horizontal attitude. However, it will still move due to the inertia. moveByAngleThrottleAsync(pitch, roll, throttle, yaw_rate, duration): change the attitude of the multirotor and than change its movement. pitch: angle of pitch, radian. roll: angle of roll, radian. throttle: throttle, ranges between 0 and 1. When the throttle is set to 0, the multirotor will lose its power and crash. Value 1 is its maximum power. yaw_rate: angular velocity at yaw axis, radian per second. duration: the time for the multirotor to keep the given attitude, second. The multirotor will automatically stop moving after duration time. moveByVelocityAsync(vx, vy, vz, duration, drivetrain, yaw_mode): change the velocity of the multirotor. vx: velocity projected at x axis, meter per second. vy: velocity projected at y axis, meter per second. vz: velocity projected at z axis, meter per second. duration: the time for the multirotor to keep the given velocity, second. If there are no command after duration time, the multirotor will maintain its previous given velocity and keep moving. If you want to stop it, you can use this API once again to set the velocity to zero. drivetrain: the default value is airsim.DrivetrainType.MaxDegreeOfFreedom, it can also be set as airsim.DrivetrainType.ForwardOnly. yaw_mode: the default value is airsim.YawMode(is_rate=True, yaw_or_rate=0.0), it can also be set as airsim.YawMode(is_rate=False, yaw_or_rate=0.0). Please notice that, under the default setting, the multirotor is not able to yaw when executing this command. moveByVelocityZAsync(vx, vy, z, duration, drivetrain, yaw_mode): change the velocity at horizontal plane and the altitude of multirotor. vx: velocity projected at x axis, meter per second. vy: velocity projected at y axis, meter per second. z: flight altitude, meter. duration: the time for the multirotor to keep the given velocity, second. If there are no command after duration time, the multirotor will maintain its previous given velocity and keep moving. If you want to stop it, you can use this API once again to set the velocity to zero. drivetrain: the default value is airsim.DrivetrainType.MaxDegreeOfFreedom, it can also be set as airsim.DrivetrainType.ForwardOnly. yaw_mode: the default value is airsim.YawMode(is_rate=True, yaw_or_rate=0.0), it can also be set as airsim.YawMode(is_rate=False, yaw_or_rate=0.0). Please notice that, under the default setting, the multirotor is not able to yaw when executing this command. moveOnPathAsync(path, velocity, timeout_sec, drivetrain, yaw_mode, lookahead, adaptive_lookahead): the multirotor will fly according to several given coordinates. path: a Vector3r array, which provides the route coordinates, meter. The form of it is [airsim.Vector3r(x, y, z), ...]. velocity: flight velocity when traveling, meter per second. timeout_sec: travel time, second. The process will end when the travel time is beyond the value whether the multirotor has reached the destination or not. The value of default setting is extremely big, thus we can let this parameter empty. drivetrain: the default value is airsim.DrivetrainType.MaxDegreeOfFreedom, it can also be set as airsim.DrivetrainType.ForwardOnly. yaw_mode: the default value is airsim.YawMode(is_rate=True, yaw_or_rate=0.0), it can also be set as airsim.YawMode(is_rate=False, yaw_or_rate=0.0). Please notice that, under the default setting, the multirotor is not able to yaw when executing this command. lookahead: the default value is -1. adaptive_lookahead: the default value is 1. moveToPositionAsync(x, y, z, velocity, timeout_sec, drivetrain, yaw_mode, lookahead, adaptive_lookahead): the multirotor will fly to given location when executed. After it reach the destination, it will automatically stop. x: distance projected at x axis, meter. y: distance projected at y axis, meter. z: flight altitude, meter. velocity: flight velocity when flying to the destination, meter per second. timeout_sec: travel time, second. The process will end when the travel time is beyond the value whether the multirotor has reached the destination or not. The value of default setting is extremely big, thus we can let this parameter empty. drivetrain: the default value is airsim.DrivetrainType.MaxDegreeOfFreedom, it can also be set as airsim.DrivetrainType.ForwardOnly. yaw_mode: the default value is airsim.YawMode(is_rate=True, yaw_or_rate=0.0), it can also be set as airsim.YawMode(is_rate=False, yaw_or_rate=0.0). Please notice that, under the default setting, the multirotor is not able to yaw when executing this command. lookahead: the default value is -1. adaptive_lookahead: the default value is 1. moveToZAsync(z, velocity, timeout_sec, yaw_mode, lookahead, adaptive_lookahead): the multirotor will vertically climb to the given altitude and automatically stop and maintain the altitude when reached. z: flight altitude, meter. velocity: flight velocity when flying to the destination, meter per second. timeout_sec: climbing time, second. The process will end when the climbing time is beyond the value whether the multirotor has reached the destination or not. The value of default setting is extremely big, thus we scan let this parameter empty. yaw_mode: the default value is airsim.YawMode(is_rate=True, yaw_or_rate=0.0), it can also be set as airsim.YawMode(is_rate=False, yaw_or_rate=0.0). Please notice that, under the default setting, the multirotor is not able to yaw when executing this command. lookahead: the default value is -1. adaptive_lookahead: the default value is 1. rotateByYawRateAsync(yaw_rate, duration): the multirotor will yaw at the given yaw rate. yaw_rate: yawing angular velocity, degree per second. duration: the time for the multirotor to keep the given yawing angular velocity, second. If there are no command after duration time, the multirotor will maintain its previous given yawing angular velocity and keep moving. If you want to stop it, you can use this API once again to set the yawing angular velocity to zero.","link":"/2020/01/15/AirSimMultirotorAPIs/"},{"title":"Python学习笔记","text":"这篇文章主要记录本人在学习Python时遇到的坑以及这个语言的一些特性，内容以时间顺序整理，比较零散杂乱。对于从零开始的同学，请参考官方文档Python 3.8.1 中文文档或其他网络上的教程。本文章将持续更新。 19/9/14 注释方法：#（一行注释），“”“ ”“”（多行注释） for循环：for （变量） in （范围），范围可以用range函数 Input函数的输入是char类型的 //是整除运算 逗号不可以用来分隔语句 使用缩进（4个空格）来代替C/C++中的大括号 19/9/15 for...in循环中，_可以作为循环变量，这时候仅循环指定次数，而不需要关心循环变量的值；事实上，_是一个合法的标识符，如果不关心这个变量，就可以将其定义成这个值，它是一个垃圾桶 定义函数时，使用函数名(*参数名)的定义方式， * 代表函数的参数是可变参数，可以有0到多个参数 一个文件代表一个模块(module)，若在不同的模块中含有同名函数，那么可以通过import导入指定的模块中的函数，如from 模块 import 函数，或者import 模块 as 自定义模块名称，再通过自定义模块名称.函数的方式调用 __name__是Python中一个隐含的变量，代表了模块的名字，只用直接执行的模块的名字才是__main__ 可以使用global指定使用的是一个全局变量，如果全局变量中没有找到对应的，那么会定义一个新的全局变量 嵌套作用域：对于函数a内部的函数b而言，a中定义的变量对b来说是在嵌套作用域中的，若要指定修改嵌套作用域中的变量，可以使用nonlocal指示变量来自嵌套作用域 pass是一个空语句，只起到占位作用 可以定义一个main函数（或者与模块名字相同的函数），再按照if __name__ = '__main__'的格式使脚本执行 19/9/17 与字符串有关的函数的调用方式为：字符串名称.字符串操作函数()，在此时字符串是一个对象，字符串操作函数的作用是向字符串对象发送一个消息 字符串实质上是一个数组，可以进行下标运算 字符串切片可以在下标运算中使用冒号进行运算，[起始字符:结束字符:间隔]，若不定义起始与终止字符，则默认为整个字符串，当间隔为负值时，以为着切片操作反向 字符串的索引为负值时，意味着索引从右到左数 列表可以理解为一个数组，其操作与字符串类似 可使用sorted函数对列表进行排序 可以使用生成式语法创建列表：f = [x for x in range(1, 10)]（此方法在创建列表后元素已经准备就绪，耗费较多内存），或f = (x for x in range(1, 10))（此方法创建的是一个生成器对象，需要数据时列表通过生成器产生，节省内存但是耗费较多时间） 可以使用yield关键字来实现迭代，使用yield就是产生了一个生成器，每次遇到yield时函数会暂停并保存当前所有的运行信息，返回yield的值，并在下一次执行此方法是从当前位置开始运行 可以定义元组，其相当于不能修改的数组，一个元组中的元素数据类型可以不同，定义元组使用t = () 列表和元组可以互相转换 可以定义集合，定义集合可以使用set = {}，元组可以转换为集合 字典类似于数组，但是它是由多组键值对组成的 19/9/19 使用class关键字定义类，再在类中定义函数，如：class 类名(object) __init__函数是用于在创建对象时进行的初始化操作 self是类的本身，是它的实例变量，在类中所有函数的第一个参数就是self，在类中修改属性值需使用self.属性值 = x的语法 实例化类的方法：对象名 = 类名(初始化函数参数) 对象中方法的引用可以采用对象.方法（也即函数）的语句，通过此方式向对象发送消息 Python中，属性和方法的访问权限只有public和private，若希望属性或方法是私有的，在给它们命名的时候要使用__开头，但是不建议将属性设置为私有的 使用_开头暗示属性或方法是受保护(protected)的，访问它们建议通过特定的方法，但实际上它们还是可以直接被外部访问 可以通过在类中定义方法以访问对象受保护的属性，在定义这些方法（函数）时，要在上一行使用@property包装这些方法 对于被保护的属性，在访问它们时采用getter方法，需添加@property，在修改它们时采用setter方法，需添加@函数（即方法）名.setter Python可以对对象动态绑定新的属性或方法 可以使用__slots__限定对象只能绑定某些属性，但是它只对当前类的对象生效，对子类不起作用 可以通过给类发送消息，在类的对象被创建出来之前直接使用其中的方法，此种方法被称为静态方法，需要在定义时添加@staticmethod，此类方法的参数不含有self 通过类方法可以获取类相关的信息并且可以创建出类的对象，需要在定义时添加@classmethod，类方法的第一个参数是cls，这个cls相当于就是在外部实例化类时定义的对象名，只不过它是放在类的内部使用了，其功能就是可以像在外部调用对象的属性和方法一样在类的内部使用对象（类）的属性和方法 19/9/20 类之间的关系： is-a：继承或者泛化，如：student is a human being，cell phone is a electronic device has-a：关联，如 department has an employee use-a：依赖，如 driver use a car 类与类之间可以继承，提供继承信息的成为父类（超类或者基类），得到继承的称为子类（派生类或者衍生类） Python中继承的写法：class 子类名(基类名) 在编程中一般使用子类去替代基类 在子类中，通过重新定义父类中的方法，可以让同一种方法在不同的子类中有不同的行为，这称为重写 20/1/11 Python中提供两个重要的功能：异常处理和断言（Assertions）来处理运行中出现的异常和错误，他们的功能是用于调试Python程序 异常：无法正常处理程序时会发生异常，是一个对象，如果不捕获异常，程序会终止执行 Python中异常处理的写法： 12345678try: #operation1except exception_type, argument: #if error occurs in operation1, execute operation2 #operation2else: #if no error occurs in operation1, execute operation3 #operation3 使用except可以不带异常类型，但是会让try-except语句捕获所有的异常，不建议这样写 可以使用expect(exception1[, expection2[, expection3]])来添加多个异常类型 argument为异常的参数，可以用于输出异常信息的异常值 也可以使用如下方法，但是与try-except有所不同： 1234try: #operation1finally: #in error occurs in operation1, directly execute operation2, otherwise, execute operation2 after operation1 finished finally和except不可以同时使用 可以使用raise触发异常 append()方法用于在列表末尾添加新的对象，对于一个数组list，可以这样使用：list.append() 多线程用于同时执行多个不同的程序，可以把占据长时间的程序中的任务放到后台处理 线程与进程：独立的线程有自己的程序入口、执行序列、程序出口，但是线程不可以独立执行，必须依存在应用程序中，由应用程序提供多个线程执行控制 在Python中使用线程：thread.start_new_thread(function, args[, kwargs])，其中function为线程函数，这个函数需要提前定义好，args为传递给线程函数的参数，是一个元组，kwargs为可选参数，此种方式称为函数式，线程的结束一般靠函数的自然结束 此外还可以使用Python所提供的threading模块，直接从threading.Thread继承：class myThread(threading.Thread)，然后重写__init__和run方法，把需要执行的代码写到run方法里面，__init__的重写方法如下： 12345def __init__(self, threadID, name, counter): threading.Thread.__init__(self) self.threadID = threadID self.name = name self.counter = counter 上述thread类提供了以下方法： run()：表示线程活动的方法 start：启动线程 join()：等待直到线程终止 isAlive()：查询线程是否活动 getName()：返回线程名 setName()：设置线程名 为了避免两个或多个线程同时运行，产生冲突，可以使用线程锁来控制线程执行的优先顺序，被锁定的线程优先执行，其他进程必须停止 可以使用threading.Lock().acquire()和threading.Lock().release()来锁定和释放线程 可以建立一个空数组用于存放线程，再通过append方法将线程添加至该数组中，通过遍历数组可以对其中的线程做同样的操作","link":"/2020/01/06/Python%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"},{"title":"Summary of Reinforcement Learning 1","text":"PrefaceThis blog is the first one of my series of blogs that summary the key points of reinforcement learning, other blogs will be updated recently according to my learning progress. These series of blogs of mine are mostly based on the following works and I’m really grateful to the contributors: Online courses of Stanford University CS234: Reinforcement Learning, Emma Brunskill and lecture notes. Blogs of 从流域到海域. Blogs of 叶强. If you find any mistake in my articles, please feel free to tell me in comments. What is reinforcement learning (RL)?RL is a kind of machine learning method that mainly focuses on the interaction between the agent (subject) and the model (environment, world). Through this interaction, the agent can gain experience and then have a better performance in some specific aspects. For example, a robot player can get a high score in a game after being trained by using RL method, or we can make the autopilot of the car to control it keep its lane and drive to the destination smoothly without any collision. A RL agent may interact with the world, and then recieve some feedback signal for each interaction. By jduging whether the feedback signal is good (beneficial to the agent’s desire performance) or not, the agent can then change its way interacting with the world (make better decisions) in order to reach the best performance. By accumulating these experiences, the agent can become more and more “smarter” and has a better performance. Some basic notions of RLBecause in the real world, we make decisions in a sequence in a period. Therefore, we need to introduce “time” to clearly indicate the quantities related to the agent at the specific position on the time axis. The notation with subscript “t” means time it is in a time sequence. Agent: The subject of RL, it is agent that interact with the world. Model: The world, the environment, the agent stays in the model. Reward: $ {r_t} $ , the feedback signal from the model, agent recieves the reward. The reward can have different values according to the different states of the agent. State: ${s_t}$ , the state of the agent. The state can be either finite or infinite, and it is set by people. Action: ${a_t}$ , the movement of the agent in the model, actions are different under different states. Observation: ${o_t}$ , the agent need to observe its state and determine the reward. History: a sequence of action, reward, observation, which is: $h_t=(a_1,o_1,r_1,…,a_t,o_t,r_t)$. Sequential Decision Making: make decision base on the history, that is: $a_{t+1}=f(h_t)$. Figure 1.1 shows how an agent interact with its world. How to model the world?Markov Property$P(s_{t+1}|s_t,a_t,…,s_1,a_1)=P(s_{t+1}|s_t,a_t)$ Left-hand side is called the transition dynamics of the world, whcih means the probability distribution over $S$. In RL, we often use this assumption. A model consists of the two elements below. Transition dynamics $P(s_{t+1}|s_t,a_t)$The probability of a specific state in the next timestep. Because an agent always has many states, $P$ is often a matrix. The dimension of $P$ denpends on the dimension of the state space. Reward function $R(s,a)$Usually, we consider the reward $r_t$ to be received on the transition between states, $s_t\\rightarrow{s_{t+1}}$. A reward function is used to predict rewards, which can be written in the form $R(s,a)=\\Bbb E[r_t|s_t=s,a_t=a]$. How to make a RL agent?Let the agent state be a function of the history, $s_t^a=g(h_t)$. An agent often consists the three elements below. Policy $\\pi(a_t|s_a^t)$Policy is a mapping from the state to an action, which means we can determine the action through the policy if we know the state. Please notice that the policy we mention here is stochastic. When the agent want to take an action and $\\pi$ is stochastic, it picks action $a\\in A$ with probability $P(a_t=a)=\\pi(a|s_t^a)$. Value function $V^\\pi$If we have discount factor $\\gamma\\in [0,1]$, which is used to weigh immediate rewards versus delayed rewards, value function is an expected sum of discounted rewards $V^\\pi=\\Bbb E_\\pi[r_t+\\gamma r_{t+1}+\\gamma ^2 r_{t+2}+…|s_t=s]$. ModelThe agent in RL may have a model. I have introduced how to make a model in section 3. Three questions we are facingDo we need exploration or exploitation?In RL, the agent must be able to optimize its actions to maximize the reward signal it receives. We have 2 ways to achieve this target, the first is to let the agent exploit what it already knows, the second is to explore the world where is unknown for the agent. This leads to a trade-off between exploration and exploitation. Can the agent generalize its experience?In actual world, the agent often has infinite states. However, it is impossible for us to include all of them in RL. Can the agent learn whether some actions are good or bad in previously unseen states? Delayed consequencesThe action executed by the agent may let it recieve high reward at present state. However, this action may have negative effects in the future. Or we can also ask, if the rewards are caused by the action the agent just took or because of the action taken much earlier? What’s next?Now we have known the basic frame and its components of reinforcement learning. But what is the exact form of the transition dynamics, reward function, policy, value function? And what’s the relationship between these functions? How can I use these functions to make an agent? We will discuss these questions in the next chapter.","link":"/2020/01/17/RLSummary1/"},{"title":"Summary of Reinforcement Learning 2","text":"Markov process (MP)Markov process is a stochastic process that satisfies the Markov property, which means it is “memoryless” and will not be influenced by the history. MP is sometimes called Markov chain. However, their defination have some slight differences. We need to make two assumptions before we define the Markov process. The first assumption is that the state of MP is finite, and we have $s_i\\in S, i\\in1,2,…$ , where $|S|&lt;\\infty$. The second assumption is that the transition probabilities are time independent. Transition probabilities are the probability to transform from the current state to a given state, whcih can be written as $P(s_i|s_{i-1}), \\forall i=1,2,…$. Base on these two assumption, we can define a transition transform matrix: The size of $\\bf P$ is $|S|\\times |S|$ and the sum of each row of $\\bf P$ equals 1. Henceforth, we can define a Markov process using a tuple $(S,\\bf P)$. $S$: A finite state space. $\\bf P$: A transition probability. By calculating $S\\bf P$ we can get the distribution of the new state. Figure 1 shows a student MP example. Markov reward process (MRP)MRP is a MP together with the specification of a reward function $R$ and a discount factor $\\gamma$. We can also use a tuple $(S,\\bf P,\\mit R,\\gamma)$ to describe it. $S$: A finite state space. $\\bf P$: A transition probability. $R$: A reward function that maps states to rewards (real numbers). $\\gamma$: Discount factor between 0 and 1. Here are some explaintions. Reward functionWhen we are moving from the current state $s$ to a successor state $s’$, a reward is obtained depending on the current state $s$ (in reality we get the reward at $s’$ ). For a state $s\\in S$, we define the expected reward by $R(s)=\\Bbb E[r_t|s_t=s]$. Here we assume that the reward is time independent. $R$ can be represented as a vector of dimension $|S|$. HorizonIt is defined as the number of time steps in each episode of the process. An episode is the whole process of a round of training. The horizon can be finite or infinite. ReturnThe return $G_t$ is defined as the discounted sum of rewards starting at time $t$ up to the horizon H. We can calculate the return using $G_t=\\sum^{H-1}_{i=t}\\gamma^{i-t}r_i$. State value functionThe state value function $V_t(s)$ is defined as the expected return starting from state $s$ and time $t$ and is given by the following expression $V_t(s)=\\Bbb E[G_t|s_t=s]$. If the episode is determined, then the $G_t$ as well as $V_t(s)$ will remain unchanged. However, because every episode is a random process, the return and state value function will be different in different episodes. Discount factorWe design the discount factor for many reasons. The best reason among them I think is that, people always pay more attention to the immediate reward rather than the long-term reward. If we set $\\gamma &lt;1$, the agent will behave like a human more. We should notice that when $\\gamma=0$, we just foucs on the immediate reward. When $\\gamma=1$, we put as much importance on future rewards as compared the present. Figure 2 and 3 shows an example of how to calculate the return. It is significant to find out a value function while many problems of RL is how to get a value function essentially. Computing the value functionWe have three ways to compute the value function. Simulation. Through simulation, we can get the value function by averaing many returns of episodes. Analytic solution. We have defined the state value function $V_t(s)=\\Bbb E[G_t|s_t=s]$. Then, make a little transformation, see Figure 4 in detail. Then, we have $V(s)=R(s)+\\gamma \\sum P(s’|s)V(s’)$, $V=R+\\gamma\\bf P\\mit V$. Therefore we have $V=(1-\\gamma \\bf P\\rm )\\mit^{-1}R$. If $0&lt;\\gamma&lt;1$, then $(1-\\gamma \\bf P\\rm)$ is always invertible. However, the computational cost of the analytical method is $O(|S|^3)$, hence it is only suitable for the cases where the $|S|$ is not very large. Notice that $s’$ includes all the possible successor states. Here is an example in Figure 5. This example shows that how to calculate the value of the state represented by the red circle. Iterative solution. $V_t(s)=R(s)+\\gamma \\sum P(s’|s)V_{t+1}(s’), \\forall t=0,…,H-1,V_H(s)=0$. We can iterate it again and again and use $|V_t-V_{t-1}|&lt;\\epsilon$ ($\\epsilon$ is tolerance) to jduge the convergence of the algorithm. Markov decision process (MDP)MDP is MRP with the specification of a set of actions $A$. We can use a tuple $(S,A,\\bf P,\\mit R,\\gamma)$ to describe it. $S$: A finite state space. $A$: A finite set of actions which are available from each state $s$. $\\bf P$: A transition probability. $R$: A reward function that maps states to rewards (real numbers). $\\gamma$: Discount factor between 0 and 1. Here are some explanations. Notifications Both $S$ and $A$ are finite. In MDP, the transition probabilities at time $t$ are a function of the successor state $s_{t+1}$ along with both the current state $s_t$ and the action $a_t$, written as $P(s_{t+1}|s_t,a_t)$. In MDP, the reward $r_t$ at time $t$ depends on both $s_t$ and $a_t$, written as $R(s,a)=\\Bbb E[r_t|s_t=s,a_t=a]$. Expect for the value functions and what we have mentioned in this section, other notions are exactly the same as MRP. PolicyBefore we mention the state value function, we need to talk about the policy for the MDP first. A policy specifies what action to take in each state, which is actually a probability distribution over actions given the current state. The policy may be varying with time, especially when the horizon is finite. A policy can be written as $\\pi(a|s)=P(a_t=a|s_t=s)$. If given a MDP and a $\\pi$, the process of reward satisfies the following two relationships: $P^\\pi(s’|s)=\\sum_{a\\in A}\\pi(a|s) P(s’|s,a)$ When we have a policy $\\pi$, the probability of the state transforms from $s$ to $s’$ equals to the sum of a series probabilities. These probabilities are the production of the probability to execute a specific action $a$ under the state $s$ and the probability of the state transforms from $s$ to $s’$ when executing an action $a$. $R^\\pi(s)=\\sum_{a\\in A}\\pi(a|s)R(s,a)$ When we have a policy $\\pi$, the reward of the state $s$ is the sum of the product of he probability to execute a specific action $a$ under the state $s$ and all rewards that the action $a$ can get under the state $s$. Value functions in MDP (Bellman expectation equations)Given a policy $\\pi$ can define two quantities: the state value function and the state-action value function. These two value functions are both Bellman expectation equations. State value function: The state value function $V^\\pi_t(s)$ for a state $s\\in S$ is defined as the expected return starting from the state $s_t=s$ at time $t$ and the following policy $\\pi$, and is given by the expression $V^\\pi_t(s)=\\Bbb E_\\pi[G_t|s_t=s]=\\Bbb E_\\pi[R_{t+1}+\\gamma V_\\pi (s_{t+1})|s_t=s]$. Frequently we will drop the subscript $\\pi$ in the expectation. State-action value function: The state-action value function $Q^\\pi_t(s,a)$ for a state $s$ and action $a$ is defined as the expected return starting from the state $s_t=s$ at time $t$ and taking the action $a_t=a$ that has nothing to do with the policy, and then subsequently following the policy $pi$, written in a mathmatical form $Q^\\pi_t(s,a)=\\Bbb E[G_t|s_t=s,a_t=a]=\\Bbb E[R_{t+1}+\\gamma Q_\\pi (s_{t+1},a_{t+1})|s_t=s,a_t=a]$. It evaluates the value of acting the action $a$ under current state $s$. Now let’s talk about the relationships between these two value functions. Figure 6 shows the actions that an agent can choose under a specific state, the white circle represents the state while black circles represent actions. We can discover that the value of a state can be denoted as $V^\\pi(s)=\\sum_{a\\in A}\\pi(a|s)Q_\\pi(s,a)$. In a similar way, Figure 7 shows what states that an action can lead to. We can also find that $Q_\\pi(s,a)=R(s,a)+\\gamma\\sum_{s’\\in S} P(s’|s,a)V^\\pi(s’)$. On the right-hand side, the first part is the value of the state $s$, the second part is the sum of the product of the value of new state $s’$ and the probability of getting into that new state. If we combine the two Bellman equation with each other, we can get $V^\\pi(s)=\\sum_{a\\in A}\\pi(a|s)[R(s,a)+\\gamma\\sum_{s’\\in S}P(s’|s,a)V^\\pi(s’)]$ ​ $=R(s’,\\pi(s’))+\\gamma\\sum_{s’\\in S}P(s’|s,\\pi(s)) V^\\pi(s’)$, and $Q_\\pi(s,a)=R(s,a)+\\gamma\\sum_{s’\\in S} P(s’|s,a)\\sum_{a\\in A}\\pi(a’|s’)Q_\\pi(s’,a’)$. The example in Figure 8 shows that how to calculate the state value of the state represented by the red circle. Notice that actions $Study$ and $Pub$ have the same probabilities $\\pi(a|s)$ to be executed, which means they are all $0.5$. Optimality value function (Bellman optimality equation) Optimality state value function $V^*(s)=\\tt max\\mit V^\\pi(s)$ indicates a state value function generated by a policy that makes the value of state $s$ the biggest. Optimality state-action value function $Q^*(s,a)=\\tt max\\mit Q_\\pi(s,a)$ indicates a state-action value function generated by a policy that makes the value of the state-action $(s,a)$ the biggest. Optimality value function determines the best performance of a MDP. When we know the optimality value function, we know the best policy and the best value of every state, and the MDP problem is solved. Solving an optimality value function require us to solve the best policy at first. Find the best policyThe best policy is defined precisely as optimal policy $\\pi^ *$ , which means for every policy $\\pi$, for all time steps, and for all states $s\\in S$ , there is $V_t^{\\pi^ *}(s)\\geq V_t^\\pi(s)$. For an infinite horizon MDP, existence of an optimal policy also implies the existence of a stationary optimal policy. Although there is an infinite horizon, we still just need to search finite policies, which equals $|A|^{|S|}$. Moreover, the optimal policy might not be unique. We can compute the optimal policy by $\\pi^*(s)=\\tt argmax\\mit V^\\pi(s)$, Which means finding the arguments ($V(s),\\pi(s)$) that produce the biggest value function. If an optimal policy exists then its value function must be a fixed point of the operator $B^*$. Bellman optimality backup operatorBellman optimality backup operator is written as $B^*$ with a value function behind it $B^*V(s)=\\tt max_a \\mit R(s,a)+\\gamma\\sum_{s’\\in S}P(s’|s,a)V(s’)$. If $\\gamma&lt;1$, $B^*$ is a strict contraction and has a unique fixed point. This means $B^*V(s)\\geq V^\\pi(s)$. Bellman operator return to a new value function and it will improve the value if possible. Sometimes we will use $BV$ to replace Bellman operator and substitute the $V$ on right-hand side of the equation. Next I’ll briefly introduce some algorithms to compute the optimal value function and an optimal policy. Policy searchThis algorithm is very simple but acquires a great number of computing resources. What it do is just trying all the possible policies and find out the biggest value function, return a value function and a policy. Policy iterationThe algorithm of policy iteration is shown below: while True do ​ $V^\\pi$ = Policy evaluation $(M,\\pi,\\epsilon)$ ($\\pi$ is initialized randomly here) ​ $\\pi^*$ = Policy improvement $(M,V^\\pi)$ if $\\pi^*(s)=\\pi(s)$ then ​ break else ​ $\\pi$ = $\\pi^*$ $V^*$ = $V^\\pi$ . Policy evaluation is about how to compute the value of a policy. As for policy improvement, we need to compute $Q_{\\pi i}(s,a)=R(s,a)+\\gamma\\sum_{s’\\in S} P(s’|s,a)V^{\\pi i}(s’)$ for all the $a$ and $s$ and then take the max return $\\pi_{i+1}=\\tt argmax\\mit Q_{\\pi i}(s,a)$. Notice that there is a relationship $\\tt max\\mit Q_{\\pi i}(s,a)\\geq Q_{\\pi i}(s,\\pi_i(s))$. This means the agent may adopt the new policy and take better actions (greater) or it just take actions following the former policy (equal). After the improvement the new policy will be monotonically better than the old policy. At the same time, once the policy converge it will never change again. Value iterationThe algorithm of value iteration is shown below: $V’(s)=0, V(s)=\\infty$, for all $s\\in S$ while $||V-V’||_\\infty&gt;\\epsilon$ do ​ $V=V’$ ​ $V’(s)=\\tt max\\mit_aR(s,a)+\\gamma\\sum_{s’\\in S}P(s’|s,a)V’(s)$, for all states $s\\in S$ $V^*=V$, for all $s\\in S$ $\\pi^ *=\\tt argmax_{a\\in A}\\mit R(s,a)+\\gamma\\sum_{s’\\in S}P(s’|s,a)V^ *(s’),\\ \\forall s\\in S$ . The idea is to run fixed point iterations to find the fixed point $V^* $ of $B^ *$.","link":"/2020/01/18/RLSummary2/"},{"title":"Summary of Reinforcement Learning 3","text":"IntroductionIn the previous article we talked about MP, MRP, MDP and how to find the best policy. All the discussions are based on the fact that we know both the rewards and probabilities for every transition. However, in many cases such information is not readily available to us. Therefore, we are going to discuss model-free algorithms in this article. Throughout this article, we will assume an infinite horizon as well as stationary rewards, transition probabilities and policies. First comes the definition of history: the history is the ordered tuple of states, actions and rewards that an agent experiences. The $j$ th history is: $h_j=(s_{j,1},a_{j,1},r_{j,1},s_{j,2},a_{j,2},r_{j,2},…,s_{j,L_j})$, where $L_j$ is the length of the interaction (interaction between agent and environment). In the article Summary of Reinforcement Learning 2 I introduced the iterative solution of value function, which is $V_t(s)=\\Bbb E_\\pi[R_{t+1}+\\gamma V_\\pi (s_{t+1})|s_t=s]$ ​ $=R(s)+\\gamma \\sum P(s’|s)V_{t+1}(s’), \\forall t=0,…,H-1,V_H(s)=0$. This ia a bootstraping process, and we estimate the value of the next state using our current estimate of next state. Monte Carlo on policy evaluationIn general, we got the Monte Carlo estimate of some quantity by iterations of how that quantity is generated either in real life or via simulation and then averaging over the observed quantities. By the law of large numbers, this average converges to the expectation of the quantity. In reinforcement learning the quantity we want to estimate is $V^\\pi(s)$ and we can get it through three steps: Execute a rollout of policy until termination many times Record the returns $G_t$ that we observe when starting at state $s$ Take an average of the values we got for $G_t$ to estimate $V^\\pi(s)$. Figure 1 shows a backup diagram for the Monte Carlo policy evaluation algorithm. And you can find that, unlike what we have talked about in the second article, Monte Carlo on policy evaluation is not a bootstraping process. How to Evaluate the Good and Bad of an Algorithm?We use three quntities to evaluate the good and bad of an algorithm. Consider a statistical model that is parameterized by $\\theta$ and that determins a probability distribution over oberserved data $P(x|\\theta)$. Then consider a statistic $\\hat\\theta$ that provides an estimate of $\\theta$ and it’s a function of observed data $x$. Then we have these quantities of the estimator: Bias: $Bias_\\theta(\\hat\\theta)=\\Bbb E\\rm_{x|\\theta}[\\hat\\theta]-\\theta$, Variance: $Var(\\hat\\theta)=\\Bbb E\\rm_{x|\\theta}[(\\hat\\theta-\\Bbb E\\rm[\\hat\\theta])^2]$, Mean squared error (MSE): $MSE(\\hat\\theta)=Var(\\hat\\theta)+Bias_\\theta(\\hat\\theta)$. First-Visit Monte CarloHere is the algorithm of First-Visit Monte Carlo: Initialize $N(s)=0,\\ G(s)=0,\\ V(s)=0,\\ \\forall s\\in S$ $N(s)$: Increment counter of total first visits $G(s)$: Increment total return $V(s)$: Estimate while each state $s$ visited in episode $i$ do ​ while first time $t$ that the state $s$ is visited in episode $i$ do ​ $N(s)=N(s)+1$ ​ $G(s)=G(s)+G_{i,t}$ ​ $V(s)=G(s)/N(s)$ return $V(s)$ First-Visit Monte Carlo estimator is an unbised estimator. Every-Visit Monte CarloHere is the algorithm of Every-Visit Monte Carlo: Initialize $N(s)=0,\\ G(s)=0,\\ V(s)=0,\\ \\forall s\\in S$ $N(s)$: Increment counter of total first visits $G(s)$: Increment total return $V(s)$: Estimate while each state $s$ visited in episode $i$ do ​ while every time $t$ that the state $s$ is visited in episode $i$ do ​ $N(s)=N(s)+1$ ​ $G(s)=G(s)+G_{i,t}$ ​ $V(s)=G(s)/N(s)$ return $V(s)$. Every-Visit Monte Carlo is a bised estimator becaue the varibles are not IID (Independently Identicaly Distribution). But it has a lower variance which is better than First-Visit Monte Carlo. Increment First-Visit/Every-Visit Monte CarloWe can replace $V(s)=G(s)/N(s)$ in both two algorithms by $V(s)=V(s)+{1\\over N(s)}(G(s)-V(s))$. Because ${V(s)(N(s)-1)+G(s)\\over N(s)}=V(s)+{1\\over N(s)}(G(s)-V(s))$. Replacing $1\\over N(s)$ with $\\alpha$ in the upper expression gives us the more general Incremental Monte Carlo on policy evaluation. Setting $\\alpha &gt; {1\\over N(s)}$ gives higher weight to newer data, which can help learning in non-stationary domains. Temporal Difference (TD) LearningTD learning is a new algorithm that combines bootstraping with sampling. It is still model-free, and it will update its value after every observation. In dynamic programming, the return is witten as $r_t+\\gamma V^\\pi(s_{t+1})$, where $r_t$ is a sample of the reward at time step $t$ and $V^\\pi(s_{t+1})$ is our current estimate of the value at the next state. We can use the upper expression to replace the $G(s)$ in the incremental Monte Carlo update and then we have $V^\\pi(s_t)=V^\\pi(s_t)+\\alpha(r_t+\\gamma V^\\pi(s_{t+1})-V^\\pi(s_t))$, and this is the TD learning update. In TD learning update, there are two concepts which are TD error and TD target. TD error is written as below: $\\delta_t=r_t+\\gamma V^\\pi(s_{t+1})-V^\\pi(s_t)$. And here is TD target, which is the sampled reward combined with the bootstrap estimate of the next state value: $r_t+\\gamma V^\\pi(s_{t+1})$. The algorithm of TD learning is shown below. Initialize $V^\\pi(s)=0,\\ s\\in S$ while True do ​ Sample tuple $(s_t,a_t,r_t,s_{t+1})$ ​ $V^\\pi(s_t)=V^\\pi(s_t)+\\alpha(r_t+\\gamma V^\\pi(s_{t+1})-V^\\pi(s_t))$ It is improtance to aware that $V^\\pi(s_{t+1})$ is the current value (estimate) of the next state $s_{t+1}$ and you can get the exact state at the following next time step. Only at that time can you know what the exact $s_{t+1}$ is and then use the current (you can also regard it as the previous one because it remains the same value at $s_t$) estimate $V^\\pi(s_{t+1})$ to calculate the value of $s_t$. Thus that’s why it is called the combination of Monte Carlo and dynamic programming due to the sampling (to approximate the expectation) and bootstraping process. In reality, if you set $\\alpha$ equals to ${1\\over N}$ or a very small value, the algorithm will converge definitely. On the contrary, it will oscilate when $\\alpha=1$, which means you just ignore the former estimate. Figure 2 shows a diagram expressing TD learning. SummaryTable below gives some fundamental properties of these three algorithms (DP, MC, TD). Properties DP MC TD Useble when no models of current domain No Yes Yes Handles continuing domains (episodes will never terminate) Yes No Yes Handles Non-Markovian domains No Yes No Coverges to true value in limit (satisfying some conditions) Yes Yes Yes Unbised estimate of value N/A Yes (First-Visit MC) No Variance N/A High Low Figure 3 shows some other properties that may help us to choose the algorithm. Batch Monte Carlo and Temporal DifferenceThe batch versions of the algorithms is that we have a set of histories that we use to make updates many times and we can use the dataset many times in order to have a better estimate. In the Monte Carlo batch setting, the calue at each state converges to the value that minimizes the mean squarred error with the observed returns. While in the TD setting, we converge to the value $V^\\pi$ that is the value of policy $\\pi$ on the maximum likelihood MDP model, where . The value function derived from the maximum likehood MDP model is known as the certainty equivalence estimate. Using this relationship, we can first compute the maximum likelihoood MDP model using the batch. Then we can compute $V^\\pi$ using this model and the model-based policy evaluation methods. This method is highly data efficient but is computationally expensive.","link":"/2020/02/01/RLSummary3/"},{"title":"Summary of Reinforcement Learning 5","text":"IntroductionSo far we have presented value function by a lookup table (vector or matrix). However, this approach might not generalize or sufficient well to problems with very large state and/or action spaces in reality. A popular approach to address this problem via function approximation: $v_\\pi(s)\\approx \\hat v(s,\\vec w)$ or $q_\\pi(s,a)\\approx\\hat q(s,a,\\vec w)$. Here $\\vec w$ is usually referred to as the parameter or weights of our function approximator. Our target is to output a reasonable value function (it can also be called as update target in this domain) by calculating the proper $\\vec w$ with the input $s$ or $(s,a)$. In this set of article, we will explore two popular classes of differentiable function approximators: Linear feature representations and Nerual networks. We will only focus on linear feature representations in this article. Linear Feature RepresentationsGradient DescentThe rough definition of gradient is that, for a function that has several variables, gradient (a vector) at a spot $x_0$ tells us the direction of the steepest increase in the objective function at $x_0$. Suppose that $J(\\vec w)$ is an arbitrary function and vector $\\vec w$ is its parameter, the gradient of it at some initial spot $\\vec w$ is: $\\nabla_\\vec wJ(\\vec w)=[{\\partial J(\\vec w)\\over\\partial w_1}{\\partial J(\\vec w)\\over\\partial w_2}…{\\partial J(\\vec w)\\over\\partial w_n}]$. In oreder to minimize our objective function, we take a step along the negative direction of the gradient vector and arrive at $\\vec w’$, mathematically written as: $\\Delta\\vec w=-{1\\over 2}\\alpha \\nabla_\\vec wJ(\\vec w)$, $\\vec w’=\\vec w+\\Delta \\vec w$ ($\\alpha$ is update step). By using this way for many times we can reach the point that our objective function is minimize (local optima). Figure 1 is the visualization of gradient descent. ####Stochastic Gradient Descent (SGD) In linear function representations, we use a feature vector to represent a state: $\\vec x(s)=[x_1(s)\\ x_2(s)\\ …\\ x_n(s)]$. We than approximate our value functions using a linear combination of features: $\\hat v(s,\\vec w)=\\vec x(s)\\vec w=\\sum_{j=1}^nx_j(s)w_j$. Our goal is to find the $\\vec w$ that minimizes the loss between a true value function $v_\\pi(s)$ and its approximation $\\hat v(s,\\vec w)$. So now we define the objective function (also known as the loss function) to be: $J(\\vec w)=\\Bbb E[(v_\\pi(s)-\\hat v(s,\\vec w))^2]$. Then we can use gradient descent to calculate $\\vec w’$ ($w$ at next time step): $\\vec w’=\\vec w-{1\\over2}\\alpha\\nabla_\\vec w[(v_\\pi(s)-\\hat v(s,\\vec w))^2]$ ​ $=\\vec w+\\alpha[v_\\pi(s)-\\hat v(s,\\vec w)]\\nabla_\\vec w\\hat v(s,\\vec w)$. However, it is impossible for us to know the true value of $v_\\pi(s)$ in real world. So we will then talk about how to do value function approximation without a model, or, in other words, find something to replace the true value to make this idea practicable. Monte Carlo with Linear Value Function Approximation (VFA)As we know, the return $G$ is an unbiased sample of $v_\\pi(s)$ with some noise. So if we substituted $G$ for $v_\\pi(s)$, we have: $\\vec w’=\\vec w+\\alpha[G-\\hat v(s,\\vec w)]\\nabla_\\vec w\\hat v(s,\\vec w)$ ​ $=\\vec w+\\alpha[G-\\hat v(s,\\vec w)]\\vec x(s)$. Tha algorithm of Monte Carlo linear value function approximation is shown below: . This algorithm can also be modified into a every-visit type. Once we have $\\vec w’$ we can calculate the approximation of the value function $\\hat v(s,\\vec w)$ by $\\vec x(s)^T\\vec w’$. Temporal Difference with Linear VFAIn TD learning we use $V^\\pi(s_t)=V^\\pi(s_t)+\\alpha(r_t+\\gamma V^\\pi(s_{t+1})-V^\\pi(s_t))$ to update $V^\\pi$. To apply this method to VFA, we can rewrite the expression of $\\vec w$ as: $\\vec w’=\\vec w+\\alpha[r+\\gamma \\hat v^\\pi(s’,\\vec w)-\\hat v(s,\\vec w)]\\nabla_\\vec w\\hat v(s,\\vec w)$ ​ $=\\vec w+\\alpha[r+\\gamma \\hat v^\\pi(s’,\\vec w)-\\hat v(s,\\vec w)]\\vec x(s)$. The algorithm of TD(0) with linear VFA is shown below: . The two algorithm we introduced above can both converge to the weights $\\vec w$ with different minimum mean squared error (MSE). Among them the MSE of TD method is slightly greater than the MC one, but it is good engouh. Control Using VFASimilar to VFAs, we can also use function approximator for action-values and we let $q_\\pi(s,a)\\approx\\hat q(s,a,\\vec w)$. In this part we will use VFA to approximate policy evaluation and than perform $\\epsilon$-greedy policy improvement. However, this process can be unstable because it involes the intersection of function approximation, bootstrapping, and off-policy learning. These three things are called as the dadely triad, which may make the result fail to converge or converge to something bad. Now I will quickly pass this part using the basic concept we have mentioned before. First we define our objective function $J(\\vec w)$ as: $J(\\vec w)=\\Bbb E[(q_\\pi(s,a)-\\hat q^\\pi(s,a,\\vec w))^2]$. Then we define the state-action value feature vector: $\\vec x(s,a)=[x_1(s,a)\\ x_2(s,a)\\ …\\ x_n(s,a)]$, and represent state-action value as linear combinations of features: $\\hat q(s,a,\\vec w)=\\vec x(s,a)\\vec w$. Compute the gradient: $-{1\\over 2}\\nabla_\\vec wJ(\\vec w)=\\Bbb E_\\pi[(q_\\pi(s,a)-\\hat q^\\pi(s,a,\\vec w))\\nabla_\\vec w\\hat q^\\pi(s,a,\\vec w)]$ ​ $=(q_\\pi(s,a)-\\hat q^\\pi(s,a,\\vec w))\\vec x(s,a)$. Compute an update step using gradient descent: $\\Delta\\vec w=-{1\\over 2}\\alpha\\nabla_\\vec wJ(\\vec w)$ ​ $=\\alpha(q_\\pi(s,a)-\\hat q_\\pi(s,a,\\vec w))\\vec x(s,a)$. Take a step towards the local minimum: $\\vec w’=\\vec w+ \\Delta\\vec w$. Just like what we have said before, we cannot get the true value of $q_\\pi(s,a)$ so we gonna use other values to replace it and the difference between those methods is the difference of the value we choose. For Monte Carlo methods, we use return $G$, and the update becomes: $\\Delta\\vec w=\\alpha(G-\\hat q_\\pi(s,a,\\vec w))\\vec x(s,a)$. For SARSA we have: $\\Delta\\vec w=\\alpha[r+\\gamma \\hat q^\\pi(s’,a,\\vec w)-\\hat q(s,a,\\vec w)]\\vec x(s,a)$. And for Q-learning: $\\Delta\\vec w=\\alpha[r+\\gamma\\tt max_{a’}\\mit\\hat q^\\pi(s’,a,\\vec w)-\\hat q(s,a,\\vec w)]\\vec x(s,a)$. Notice that because of the value function approximations, which can be expansions, converge is not guaranteed. The table below gives the summary of convergence of control methods with VFA and (Yes) means the result chatters around near-optimal value function. Algorithm Tabular Linear VFA Nonlinear VFA MC Control Yes (Yes) No SARSA Yes (Yes) No Q-learning Yes No No In the next article we will talk about deep reinforcement learning using nerual networks.","link":"/2020/02/19/RLSummary5/"},{"title":"Summary of Reinforcement Learning 4","text":"IntroductionIn this article we will discuss model-free control where we learn good policies under the same constrains (only interactions, no knowledge of reward structure or transition probabilities). In actual world, many problems can be modeled into a MDP and model-free control is important for some problems in two types of domains: MDP model is unknown but we can sample the trajectories from the MDP MDP model is known but computing the value function is really really hard due to the size of the domain There are two types of policy learning under model-free control domain, which are on-policy learning and off-policy learning. On-policy learning: base on direct experience and learn to estimate and evaluate a policy from experience obtained from following that policy Off-policy learning: learn to estimate and evaluate a policy using experience gathered from following a different policy Generalized Policy IterationIn Summarize of Reinforcement Learning 2 we have learned the algorithm of policy iteration, which is: (1) while True do (2) $V^\\pi$ = Policy evaluation $(M,\\pi,\\epsilon)$ ($\\pi$ is initialized randomly here) (3) $\\pi_{i+1}=\\tt argmax\\ \\mit Q_{\\pi i}(s,a)=\\tt argmax\\mit \\ [R(s,a)+\\gamma\\sum_{s’\\in S} P(s’|s,a)V^{\\pi i}(s’)]$ (4) if $\\pi^*(s)=\\pi(s)$ then (5) break (6) else (7) $\\pi$ = $\\pi^*$ (8) $V^*$ = $V^\\pi$ . In order to make this algorithm model-free, we can do the policy evaluation (line 2) using the methods we mentioned in the last article. Because we are talking about control, so we use state-action value function $Q^\\pi(s,a)$ to substitute $V^\\pi$ in line 2, in a Monte Carlo way. The algorithum of MC for policy Q evaluation is written below: Initialize $N(s,a)=0,\\ G(s,a)=0,\\ Q^\\pi(s,a)=0,\\ \\forall s\\in S,\\ a\\in A$ Using policy $\\pi$ to sample an episode $i=s_{i,1},a_{i,1},r_{i,1},…$ while each state, action $(s,a)$ visited in episode $i$ do ​ while first/every time $t$ that the state, action $(s,a)$ is visited in episode $i$ do ​ $N(s,a)=N(s,a)+1$ ​ $G(s,a)=G(s,a)+G_{i,t}$ ​ $Q^{\\pi i}(s,a)=Q^{\\pi i}(s,a)/N(s,a)$ return $Q^{\\pi i}(s,a)$. Thereby, accroding to the definition, we can modify the line 3 directly as: $\\pi_{i+1}=\\tt argmax\\ \\mit Q_{\\pi i}(s,a)$. There are a few caveats to this modified algorithm (MC for policy Q evaluation): If policy $\\pi$ is determiniistic or dosen’t take every action with some positive probability, then we cannot actually compute the argmax in line 3 The policy evaluation algorithm gives us an estimate of $Q^\\pi$, so it is not clear whether (while we want to make sure that) line 3 will monotonically improve the policy like the model-based case. Importance of ExplorationPlease notice the first caveat we just mentioned above, this means, in other words, the policy $\\pi$ needs to explore actions, even if they might be suboptimal with respect to our current Q-value estimates. And this is what we have talked about in the first article: the relationship between exploration and exploitation. Here is a simple way to balance them. $\\epsilon$-greedy PoliciesThis strategy is to take random action with small probability and take the greedy action the rest of the time. Mathematically, an $\\epsilon$-greedy policy with respect to the state-action value $Q^\\pi(s,a)$ takes the following form: . It can be summarized as: $\\epsilon$-greedy policy selects a random action with probability $\\epsilon$ or otherwise follows the greedy policy. Monotonic $\\epsilon $-greedy Policy ImprovementWe have already provided a strategy to deal with the first caveat and now we are going to focus on the second one: to prove the monotonic $\\epsilon$-greedy policy improvement. And here is the proof. Now we have that $Q^{\\pi_i}(s,\\pi_{i+1}(s))\\ge V^{\\pi_i}(s)$ implies $V^{\\pi_{i+1}}(s)\\ge V^{\\pi_i}$ for all states, as desired. Thus, the monotonic $\\epsilon $-greedy policy improvement shows us that our policy does in fact improve if we act $\\epsilon$-greedy on the current $\\epsilon$-greedy policy. Greedy in the Limit of Infinite Exploration (GLIE)$\\epsilon$-greedy is a naive way to balance exploration and exploitation and we can refine it. The new class of exploration strategies is called Greedy in the Limit of Infinite Exploration (GLIE), which allows us to make convergence guarantees about our algorithms. A policy is GLIE if it satisfies the following two properties: All state-action pairs are visited an infinite number of times: $\\lim_{i\\rightarrow\\infty}N_i(s,a)\\rightarrow\\infty$ Behavior policy converges to greedy policy A simple GLIE strategy is $\\epsilon$-greedy policy where $\\epsilon$ is decayed to zero with $\\epsilon_i={1\\over i}$, $i$ is the epsiode number. Monte Carlo ControlHere is the algorithm of online Monte Carlo control: . The algorithm is first-visit online Monte Carlo control precisely and you can modify it to every-visit online Monte control easily. If $\\epsilon$-greedy strategy used in this algorithm is GLIE, then the Q-value derived from the algorithm will converge to the optimal Q-function. Tempooral Difference Methods for ControlThere are two methods of TD-style model-free control: on-policy and off-policy. We first introduce the on-policy method, called SARSA. SARSAHere is the algorithm: . SARSA stands for State, Action, Reward, next State, Action taken in next state. Because this algorithm updates the Q-value after it gets the tuple $(s,a,r,s’,a’)$, it is called SARSA. SARSA is an on-policy method because the actions $a$ and $a’$ used in the update equation are both from the policy that is being followed at the time of the update. SARSA for finite-state and finite-action MDP’s converges to the optimal action-value if the following conditions hold: The sequence of policies $\\pi$ from is GLIE The step-sizes $\\alpha_t$ satisfy the Robbins-Munro sequence such that: $\\sum^\\infty_{t=1}\\alpha_t=\\infty,\\ \\sum^\\infty_{t=1}\\alpha_t^2&lt;\\infty$ (although we generally don’t use the step-sizes satisfy this condition in reality). Q-LearningHere is the algorithm: . The biggest different between Q-learning and SARSA is that, Q-learning takes a maximum over the actions at the next state, this action is not necessarily the same same as the one we would derive from the current policy. On the contrary, the agent will choose the action that brings the biggest reward directly and this behavior actually updates the policy because, when we adopt $\\epsilon$-greedy we definately introduce Q-value. Q-learning updates the Q-value (policy) after it gets the tuple $(s,a,r,s’)$. And this is why it is called off-policy. However, in SARSA, as we stated before, the action $a’$ derives from the current policy that has not been updated. The agent may choose a bad action $a’$ randomly following the $\\epsilon$-greedy policy and this may lower the Q-value of some state-action pairs after the update. This consequently lead to the result that, SARSA might not figure out the optimal trajectory of the agent but the suboptimal one. Double Q-LearningIn Q-learning, the state values $V^\\pi(s)=\\sum_{a\\in A}\\pi(a|s)Q_\\pi(s,a)$ can suffer from maximization bias (bias introduced by the maximization operation) when we have finitely many samples. Our state value estimate is at least as large as the true value of state $s$, so we are systematically overestimating the value of the state. In Q-learning, we can maintain two independent unbiased estimates, $Q_1$ and $Q_2$ and when we use one to select the maximum, we can use the other to get an estimate of the value of this maximum. This is called double Q-learning which is shown below: . Double Q-learning can significantly speed up training time by eliminating suboptimal actions more quickly then normal Q-learning.","link":"/2020/02/16/RLSummary4/"},{"title":"Summary of Reinforcement Learning 6","text":"IntroductionIn the last article we briefly talked about control using linear vlaue function approximation and three different methods. For example in Q-learning, we have: $\\Delta\\vec w=\\alpha[r+\\gamma\\tt max_{a’}\\mit\\hat q^\\pi(s’,a,\\vec w)-\\hat q(s,a,\\vec w)]\\vec x(s,a)$. Then we can take calcullate the weight: $\\vec w’=\\vec w+\\Delta\\vec w$. Finally we can compute the function approximator: $\\hat q(s,a,\\vec w)=\\vec x(s,a)\\vec w$. The performance of linear function approximators highly depends on the quality of features ($\\vec x(s,a)=[x_1(s,a)\\ x_2(s,a)\\ …\\ x_n(s,a)]$) and it is difficult and time-consuming for us to handcraft an appropriate set of features. To scale up to making decisions in really large domains and enable automatic feature extraction, deep neural networks (DNNs) are used as function approximators. In the following contents, we will introduce how to approximate $\\hat q^\\pi(s’,a,\\vec w)$ by using a deep neural network and learn neural network parameters $\\vec w$ via end-to-end training. And we will introduce three popular value-based deep reinforcement learning algorithms: Deep Q-Network (DQN), Double DQN and Dueling DQN. It is OK for a deep-learning freshman to study deep reinforcement learning and one doesn’t need to expert in deep learning. He/She just need some basic concepts of deep learning which we will discuss next. Deep Neural Network (DNN)DNN is the composition of miltiple functions. Assuming that $\\vec x$ is the input and $\\vec y$ is the output, a simple DNN can be written as: $\\vec y=h_n(h_{n-1}(…h_1(\\vec x)…))$, Where $h$ are different functions. These functions can be linear or non-linear. For linear functions, $h_n=w_n h_{n-1}+b_n$, $w_n$ is weight and $b_n$ is bias. For non-linear functions, $h_n=f_n(h_{n-1})$. The $f_n$ here is called as activation function, such as sigmoid function or relu function. The purpose of setting activation function is to make the nerual network more like the human nerual system. If all the functions are differentiable, we can use chain rule to back propagate the gradient of $\\vec y$. Now we have some tools such as Tensorflow or Pytorch to help us compute the gradient automatically. Typically we need a loss function to fit the parameters. In DNN (as well as CNN) we update weights and biases to get the desired output. In deep Q-learning, the outputs are always some scalers, in other words, Q-value. Figure 1 shows the structure of a nerual network that is relatively complex. The important components of one of the routes is marked. Figure 2 shows the detailed structure of a node. Benefits Uses distributed representations instead of local representations Universal function approximator Can potentially need exponentially less nodes/parameters to represent the same function Can learn the parameters using SGD Convolutional Nerual Network (CNN)CNN is widely used in computer vision. If you want to make decisions using pictures, CNN is very useful for visual input. Images have structure, they have local structure and correlation. They have distictive features in space and frequency domain. CNN can extract these features and give the output. Figure 3 shows the basic process as well as some features of CNN. Now I am going to give you a brief introduction of how a CNN works. Receptive FieldFirst, we need to randomly choose a part of the image as the input of a hidden unit. That part chosen from the image is called as filter/kernel/receptive field (we will call it filter after that). The range of the filter is called filter size. In the example showned in Figure 3, the filter size is $5\\times 5$. One CNN will have many filters and they form what we called input batch. Input batch is connected to the hidden units. StrideNow we want the filter to scan all over the image. We can slide the $5\\times5$ filter over all the input pixels. If the filter move 1 pixel each time it slides, we define that the stride length is 1. Of course we can use other stride lengths. Assume the input is $28\\times28$, than we need to move $24\\times24$ times and we will have a $24\\times24$ first hidden-layer. For a filter, it will have 25 weights. Shared Weights and Feature MapFor a same feature in the image, we want the algorithm able to recognize it no matter it is showned in any part of it (left side, right side, etc.) or in any direction (vertical, horizontal, etc.). Thus, no matter where the filter moves, we want its weights are always the same. In this example, for the whole CNN we will have 25 weights totally. This feature is called shared weights. The map from the input layer to the hidden layer is therefore a feature map: all nodes detect the same feature in different parts. The feature map is defined by the shared weights and bias and it is the result of the application of a convolutional filter. Convolutional LayersFeature map is the output of convolutional layer. Figure 7 and Figure 8 gives you a visualized example of how it works. In Figure 8, the green matrix is a image (input) while the yellow matrix in it is a $3\\times3$ filter. The red numbers in the filter are weights. The pink matrix at the right is a feature map derives from the left. The value of each unit in feature map is the sum of the value of each unit in the filter times its weight. Pooling LayersPooling layers are usually used immediately after convolutional layers. They compress the information in the output from the convolutional layers. A pooling layer takes each feature map output form convolutional layer and prepares a condensed feature map. ReLU LayersReLU is the abbrivation of rectified linear unit. It is constructed by non-linear functions (activation functions). It increases the nonlinear properties of the overall network without affecting the filters of the convolution layer. Fully Connected LayersThe process we have talked about is designed to catch the features of the image. After we have done this, we are going to do regression. This work is done by fully connected layers. They can do regression and output some scalers (Q-value in deep Q learning domain). We now have a rough idea towards CNN. If you want know more about it, you can go to this website. Deep Q-LearningOur target is to approximate $\\hat q(s,a,\\vec w)$ by using a deep neural network and learn neural network parameters $\\vec w$. I will give you an example first and then talk about algorithms. DQN in AtariAtari is a video game. Researchers tried to apply DQN to train the computer to play this game. The architecture of the DQN they designed is shown in Figure 11. The input to the network consists of an $84\\times84\\times4$ preprocessed image, followed by three convolutional layers and two fully connected layers with a single output for each valid action. Each hidden layer is followed by a rectifier nonlinearity (ReLU). The network outputs a vector containing Q-values fro each valid action. The reward is change in score for that step. Preprocessing Raw PixelsThe raw Atari frames are of size $260\\times260\\times3$, where the last dimension is corresponding to the RGB channels. The preprocessing step aims at reducing the imput dimensionality and dealing with some artifacts of game emulator. The process can be summarized as follows: Single frame coding: the maximum value of each pixel color value over the frame being encoded and the previous frame is returned. In other words, we return a pixel-wise max-pooling of the 2 consecutive raw pixel frames. Dimensionality reduction: extract the luminance channel, from the encoded RGB frame and rescale it to $84\\times84\\times1$. The above preprocessing is applied to the 4 most recent raw RGB frames and the encoded frames are stacked together to produce the input ($84\\times84\\times4$) to the Q-network. Training Algorithm for DQNEssentially, the Q-network is learned by minimizing the following mean squarred error: $J(\\vec w)=\\Bbb E_{(s_t,a_t,r_t,s_{t+1})}[(y_t^{DQN}-\\hat q(s_t,a_t,\\vec w))^2]$, where $y_t^{DQN}$ is the one-step ahead learning target: $y_t^{DQN}=r_t+\\gamma\\tt max_{a’}\\mit \\hat q(s_{t+1},a’,\\vec w^-)$, where $\\vec w^-$ represents the parameters of the target network (belong to CNN, the desire true value) and the parameters $\\vec w$ of the online network (belong to function approximator) are updated by sampling gradients from minibatches of past transition tuples $(s_t,a_t,r_t,s_{t+1})$. Notice that when we refer to target network/targets, things are related to the so-called true values provided from Q-network (CNN). And when we refer to online network, things are related to the Q-learning process. In the last article, we talked about Q-learning with value function approximation. But Q-learning with VFA can diverge. DQN introduces two major changes in order to avoid divergence, which are experience replay and a separate target network. Experience ReplayThe agent’s experiences (or transitions) at each time step $e_t=(s_t,a_t,r_t,s_{t+1})$ are stored in a fixed-sized dataset (or replay buffer) $D_t={e_1,…,e_t}$. Figure 12 shows how a replay buffer looks like. To perform experience replay, we need to repeat the following: $(s,a,r,s’)$~$D$: sample an experience tuple form the dataset Compute the target value for the sampled $s$: $y_t^{DQN}=r_t+\\gamma\\tt max_{a’}\\mit \\hat q(s_{t+1},a’,\\vec w^-)$ Use SGD to update the network weights: $\\Delta\\vec w=\\alpha[r+\\gamma\\tt max_{a’}\\mit\\hat q^\\pi(s’,a,\\vec w^-)-\\hat q(s,a,\\vec w)]\\vec x(s,a)$ Target NetworkTo further improve the stability of learning and deal with non-stationary learning targets, a separate target network is used for generating the targets $y_j$ in the Q-learning update. More specifically, after every $C$ steps the target network $\\hat q(s,a,\\vec w^-)$ is updated by copying the parameters’ values $(\\vec w^-=\\vec w)$ from the online network $\\hat q(s,a,\\vec w)$, and the target network remains unchanged and generates targets $y_j$ for the following $C$ updates. Summary of DQN and Algorithm DQN uses experience replay and fixed Q-tragets Store transition $(s_t,a_t,r_t,s_{t+1})$ in replay buffer $D$ Sample minibatch of transitions $(s,a,r,s’)$ from $D$ Compute Q-learning target with respect to old, fixed parameters $\\vec w^-$ Optimizes MSE between Q-network and Q-learning targets Uses stochastic gradient descent The algorithm of DQN is shown below: Double Deep Q-Network (DDQN)After the successful application of DQN to Atari, people become very interested in it and developed many other improvements, while DDQN and Dueling DQN are two very popular algorithms among them. Let’s talk about DDQN first. Recall in Double Q-learning, in order to eliminate maximization bias, two Q-functions are maintained and learned by randomly assigning transitions to update one of two functions, resulting two different sets of parameters, denote here as $w$ and $w’$. This idea can also be extented to deep Q-learning. The target network in DQN architecture provides a natural candidate for the second Q-function, without introducing additional networks. Similarly, the greedy action is generated accroding to the online network with parameters $w$, but its value is estimated by the target network with parameters $w^-$. The resulting algorithm is reffered as DDQN, which just slightly change the way $y_t$ updates: $y_t^{DDQN}=r_t+\\gamma\\hat q(s_{t+1},\\tt argmax_{a’}\\mit\\hat q(s_{t+1},a’,\\vec w),\\vec w^-)$. Dueling DQNBefore we delve into dueling architecture, let’s first introduce an important quantity, the advantage function, which relates the value and Q-functions (assume following a policy $\\pi$): $A^\\pi(s,a)=Q^\\pi(s,a)-V^\\pi(s)$. Intuitively, the advantage function sbstracts the value of the state from the Q funciton to get a relative measure of the importance of each action. DQN approximates the Q-function by decoupling the value function and the advantage function. Figure 13 illustrates the dueling network architecture and the DQN for comparison. The different between dueling network and DQN is that, the dueling network uses two streams of fully connected layers. One stream is used to provide value function estimate given a state, while the other stream is for estimating advantage function for each valid action. Finally, the two streams are comined in a way to produce and approximate the Q-function. Why these two separated streams are designed? First, for many states, it is unnecessary to estimate the value of each possible action choice. Second, features required to determine the value function may be different than those used to accurately estimate action benefits. Let’s denote the scalar output value function from one stream of fully-connected layers as $\\hat v(s,\\vec w,\\vec w_v)$, and denote the vector output advantage function from the other stream as $A(s,a,\\vec w,\\vec w_A)$. We use $\\vec w$ here to denote the shared parameters in the convolutional layers, and use $\\vec w_v$ and $\\vec w_A$ to represent parameters in the two different streams of fully-connected layers. According to the definition of advantage function, we have: $\\hat q(s,a,\\vec w,\\vec w_v,\\vec w_A)=\\hat v(s,\\vec w,\\vec w_v)+A(s,a,\\vec w,\\vec w_A)$. However, the expression above is unidentifiable, which means we can not recover $\\hat v$ and $A$ form a given $\\hat q$. This unidentifiable issue is mirrored by poor performance in practice. To make Q-function identifiable, we can force the advantage function to have zero estimate at the chosen action. Then, we have: $\\hat q(s,a,\\vec w,\\vec w_v,\\vec w_A)=\\hat v(s,\\vec w,\\vec w_v)+(A(s,a,\\vec w,\\vec w_A)-\\tt max_{a’\\in A}\\mit A(s,a’,\\vec w,\\vec w_A))$. Or we can just use mean as baseline: $\\hat q(s,a,\\vec w,\\vec w_v,\\vec w_A)=\\hat v(s,\\vec w,\\vec w_v)+(A(s,a,\\vec w,\\vec w_A)-{1\\over|A|}\\sum_{a’}A(s,a’,\\vec w,\\vec w_A))$.","link":"/2020/02/23/RLSummary6/"},{"title":"解决幻16睡眠自动唤醒问题与电源管理解锁","text":"简单聊聊幻16最近换了一台ROG的幻16，我对这台电脑各方面都还比较满意。最开始我是想买xps17的，但是xps9710今年的更新只把显卡升级到了3060（60W丐中丐），然后可选配置砍了好多，同配置9710比9700还贵了1k+。可能戴尔这定价策略就是普确信吧😅。把xps17从选择中一脚踹走之后，我把幻16、灵越16plus、Thinkbook 16p、灵刃15纳入了考虑范围。但是灵越16plus散热拉胯，Thinkbook 16p实在太丑，于是也被排除。决赛圈是幻16和灵刃15。灵刃15的外观和性能都相当吸引人，但是对于我这种重度办公用户，它败就败在没有16:10的屏幕。最终我还是选择了幻16。 幻16综合来说是一台素质非常不错的电脑（所谓“创意设计笔记本”）。相比于游戏本它的外观比较低调（虽然我觉得A面的彩虹亮片装饰还是有些张扬），然后键盘也没有花里胡哨的RGB灯。这种简洁的外观设计对办公人士是相当友好的。 其次，幻16没有数字小键盘是另一个吸引我的设计。我个人还是比较喜欢Macbook上那种键盘布局的，数字小键盘对于我来说没多大用处而且占C面空间。取消小键盘带来的额外空间被用于布置扬声器。幻16上配置有6单元的扬声器，其音响效果非常不错，这是让我感到比较惊艳的一点。此外C面还安装有一块硕大的玻璃触控板，手感亦是上佳（虽然仍然比不上Macbook）。幻16的开机键集成了指纹解锁功能，免除了输入密码的烦恼，相当方便。 这台电脑的屏幕素质亦是相当优秀：2K分辨率、16:10的比例、P3色域、165Hz刷新率、以及极高的屏占比。在日常使用中，我几乎不会感知到像素点。由于是IPS屏幕，因此其或多或少有点漏光。这块屏幕的素质足够胜任一般的图像处理与视频剪辑工作了。 我入手的这台低配幻16的硬件属于标准的创意设计笔记本的配置：11代Intel酷睿i7，RTX3060（80W，6G显存），板载内存8G+一个最高可以扩展到32G的内存插槽（DDR4，3200MHz），标配三星512G的硬盘（PCIE-4）以及一个PCIE-3的M.2硬盘插槽。如果是高配版则有RTX3070（8G显存）以及16G板载内存。 幻16的接口还是比较丰富的。它有一个雷电4口（USB Type-C）、三个USB3接口（1个USB Type-C，2个USB A）、RJ45网线接口、HDMI接口、3,5mm耳机/麦克风接口、DC电源接口。另外，幻16还配有一个读卡器，不过比较尴尬的是它是一个TF卡的读卡器…… 下面讲讲我觉得这台电脑存在的不足之处： 品控不稳定：光这个点就可以说好多好多…… 根据网友反映，这台电脑存在品控问题有： 屏幕弯曲（通病） 按压屏幕上缘摄像头周围会出现松动异响（通病） 屏幕漏光严重（部分出现） 电流声、电容高频啸叫（通病） 键盘按键喷漆不均匀，打开键盘背光漏光（本人独一家，目前网上还没有类似情况，已换） 键盘按键（B、N键）不平（通病） C面上缘的指示灯太亮了，屏幕会反射灯光，有点影响体验，目前我把三个灯用黑胶布贴上了 在高负载时，风扇噪音实在太吵，在风扇转速最高时，我测得的人位噪声有50dB，另外即便如此C面还是很烫 C面的类肤质材料不易清洁 如果上面的几个问题可以解决，那么这台电脑就是我心目中的完美最强六边形战士笔记本了（可惜解决不了，解决了也不会是现在这个价格）。目前最接近我心目中的完美笔记本应该就是今年的Thinkpad X1 Extreme了，静待发售之后的测评吧！ 解决幻16睡眠自动唤醒问题之前说过，幻16是一台好机器，但也不完全是一台好机器。除了硬件上的一些瑕疵，软件上也有一些问题。这些软件上的问题，很多都是由Win10带来的😐。最大的一个问题就是它会在睡眠的时候自动唤醒。下面讲讲我解决这个问题的坑爹过程。 某天在我睡觉时，原本在睡眠状态的电脑屏幕突然亮起，照亮了整个房间。过了一小会儿后屏幕又自动熄灭，电脑继续进入睡眠状态。见到如此情形，我顿时睡意全无，强迫症患者表示无法忍受。遂起身下床打开搜索引擎准备修bug。没想到这个bug一修就是将近3天。 首先在事件查看器中看看引起睡眠唤醒的原因。检查我在睡觉的时间内记录的系统日志，这个时候电脑应该都在睡眠状态（包括开盖和合盖时睡眠的情况）。经过我的总结，导致电脑自动唤醒的原因有下面几个： Input Mouse Input Keyboard 50（未知原因） 首先解决Input Mouse/Keyboard的问题。经过一番查询，网络提供的解决办法为：在设备管理器中展开鼠标和其他指针设备，右键点击设备打开属性，在电源管理一栏中取消勾选允许此设备唤醒计算机。由于我是用的是无线鼠标，因此还需要在键盘选项中对HID Keyboard Device执行相同的操作。 设置完成以后按WIN+L锁屏进入闲置状态进行测试，电脑仍然出现了自动唤醒的问题。多次复现问题后查看系统日志，发现自动唤醒的原因仍然有Input Mouse/Keyboard。于是关闭鼠标电源，再次测试，问题依旧。怒，直接拔掉鼠标接收器，睡眠得以正常。但是如果要每次离开电脑的时候都拔掉鼠标接收器，不但很麻烦，而且容易把接收器弄丢。网友分析出现这种状况有可能是Win10离开模式的锅。 右击电池图标进入电源选项，点击窗口右侧更改计划设置后再点击更改高级电源设置，在它的睡眠选项中竟然没有允许离开模式策略这个项设置。对比其他人的高级电源管理，我的电源管理中的可设置项只有寥寥几个。于是又是一番搜索，发现需要改注册表。于是按照方法修改注册表，解锁了大部分隐藏的设置（下一节会介绍）。关闭了离开模式以后再次进行测试，发现在锁屏状态下进入睡眠后仍然会有几率自动唤醒，无语。由电脑的电源指示灯我发现，锁定后电脑黑屏一段时间以后，指示灯才开始进行规律的闪烁，这标志着电脑真正进入睡眠状态了。而指示灯常亮且电脑黑屏时，电脑应该只是处于离开模式。于是我干脆把电脑在闲置状态下进入睡眠的时间缩短到5分钟，让鼠标在唤醒电脑之前直接让电脑从离开模式进入睡眠状态。至此，鼠标在无操作状态下唤醒电脑的问题得到了基本解决。 为了解决鼠标自动唤醒电脑的这个问题，我还尝试过在终端中通过命令的形式来修改设置以解决问题，但是同样也没有效果，遂放弃。可以说这个问题没有得到根本的解决，只是通过缩短进入睡眠的时间将它掩盖了。 本来以为问题已经解决了，但是！在晚上睡觉的时候，电脑屏幕又双叒亮了！暴起，合上屏幕继续睡觉、第二天起床查看系统日志，发现即使在合盖情况下，电脑仍会被唤醒，只是屏幕不会点亮而已。同时我还发现，电脑每隔一小时就会被唤醒一下，并且每次唤醒后系统日志的格式均如下所示： 系统正在退出连接待机状态，原因: 50 系统正在进入连接待机状态，原因: 50 进程 C:\\Program Files\\ASUS\\ARMOURY CRATE Service\\ArmouryCrate.UserSessionHelper.exe (进程 ID: 9384)将策略方案从 {381b4222-f694-41f0-9685-ff5bb260df2e} 重置为 {381b4222-f694-41f0-9685-ff5bb260df2e} 看样子这是奥创中心的服务，于是我去任务计划程序看看有什么程序是定时启动的。 在任务计划程序中左侧一栏中展开任务计划程序库，选择ASUS一栏。比对我的电脑睡眠自动唤醒的时间，我发现了其中一个程序的触发时间匹配上了唤醒时间，而且被设定为每小时触发一次。我将触发条件更改为当任何用户登录时后再进行测试，结果发现问题依旧…… 在走投无路的情况下，我直接把奥创中心卸载了，重启之后发现键盘背光没法亮了😑，只好又把奥创中心重新装了回去。突然我想到，如果不能删除奥创中心，我能不能只删除掉ArmouryCrate.UserSessionHelper.exe这个服务呢？ 打开任务管理器，找到ArmouryCrate.UserSessionHelper.exe，右键打开菜单并点击打开文件所在位置。尝试删除这个程序，提示程序正在运行中无法删除。尝试通过剪切将程序移出当前文件夹，成功！然后在任务管理器中结束ARMOURY CRATE Service，可以发现任务管理器中ArmouryCrate.UserSessionHelper.exe没有再自动启动。 重启电脑后，经测试键盘背光灯可以正常工作。移除该服务后，奥创中心的功能会缺失不少，键盘上的奥创中心按键也无法再使用，但是核心功能——切换情景模式还是可以使用的。 再次进行睡眠测试，电脑终于不会再自动唤醒了！而且，电脑睡眠时不再烫手，风扇也不会再转了！ 罪魁祸首就是奥创中心！ 奥创中心将游戏本的性能和散热策略直接放在幻16上，只会让它又热又吵而且耗电还快。但其实把所有的锅都推给奥创中心是不太合理的，虽然这个软件确实垃圾。 实际上最坑最坑的还是Windows 10强行推出的现代睡眠模式（S0睡眠）。这个睡眠模式不同于以往的S3睡眠，S0睡眠下电脑除屏幕外其他设备都是供电的，相当于手机的熄屏状态。此外，由于微软一意孤行推广S0睡眠，这种睡眠模式还无法更改，甚至bios里都没有更改睡眠模式的选项。像我之前的电脑能设置S3睡眠，就没这么多屁事。 电源管理解锁在折腾幻16的睡眠问题的时候我发现，机器上Win10的高级电源管理与其他人相比少了很多设置项。经过一番搜索之后，发现要通过修改注册表的方式来解锁这些设置。下面讲讲具体方法。 首先打开注册表编辑器，在左侧的资源管理器中找到这个文件夹：计算机\\HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Power。 在这个文件夹下，PowerSettings文件夹中的项目为高级电源管理的所有设置项，\\User\\PowerSchemes文件夹中的项目为所有的电源计划。 首先我们来解锁隐藏的电源计划。 在\\User\\PowerSchemes的目录下随便点开一个文件夹，这里以27fa6203-3987-4dcc-918d-748559d549ec为例。选中该文件夹之后，在右侧的项目中有一项名称为FriendlyName，这个项目的数据（值）为Performance。因此，该文件夹中的内容为性能模式的设置项。 展开该文件夹，选中245d8541-3943-4422-b025-13a784f679b7这个文件夹，可以看到如下图所示的设置项。其中，ACSettingIndex和DCSettingIndex分别为该电源计划在交流供电和电池供电的情况下的可用性。如果值为0，则在该情况下不可用。因此，为了解锁这个隐藏的电源计划，我们要将这个两个设置项的值都设为1。 鼠标右键点击设置项，选择修改。在修改它的值之后点击确定，会出现错误提示：无法编辑xxx。编辑该值时出错。，这是因为你没有权限修改这个值。 在左侧的资源管理器中右击当前文件夹，选择权限。 在弹出的窗口中点击高级按钮 在高级安全设置的窗口中，点击上方所有者右侧的蓝色更改选项 然后还是在弹出的窗口中点击高级按钮 在新的弹窗右侧点击立即查找 在窗口下方找到你的用户名后选中 点击确定 点击确定 你可以看到所有者变为自己的账户名 执行完上面的步骤，你现在只是有了修改修改注册表的权限的权限，你还要执行下面的步骤以获得修改注册表的权限。 在设置权限的窗口中点击添加 在弹出的窗口中点击高级 在新的弹窗右侧点击立即查找 在窗口下方找到你的用户名后选中 点击确定 点击确定 在权限一栏中的完全控制项中勾选允许 点击应用 你可以在组或用户名中看到自己的账户名 点击确定关闭窗口，现在你应该可以修改该文件夹下注册表的值以解锁隐藏的电源计划了。修改完成后，在电源选项窗口中你可以发现，原本隐藏的电源计划出现了。 对于其他隐藏的电源计划，依照上面的方法举一反三同样可以解锁。区别仅仅在于需要选择不同电源计划的文件夹。而不同电源计划的设置项：ACSettingIndex和DCSettingIndex所在的文件夹都是电源计划的文件夹下名为245d8541-3943-4422-b025-13a784f679b7的文件夹。 然后来讲一下如何解锁高级电源管理的隐藏设置项。 解锁高级电源管理的隐藏设置项不需要更改权限，所以操作起来相对简单。在计算机\\HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Power\\PowerSettings的路径下随便选择一个文件夹，这里以238C9FA8-0AAD-41ED-83F4-97BE242C8F20文件夹为例。选中之后，右侧FriendlyName项的值有Sleep transition settings，这指明了该文件夹下的设置项均为睡眠相关设置。 点击该文件夹下的第二个文件夹25DFA149-5DD1-4736-B5AB-E8A37B5B8187，其右侧FriendlyName项的值有Allow Away Mode Policy。因此我们可以知道该项是用来设置离开模式的。对于任何一个设置项，只有Attributes的值为2时它才会在高级电源管理中显示，我们只需要右键Attributes并点击修改，将它的值改为2即可。 对于其他隐藏的高级电源管理设置项，仿照上面的方法同样可以解锁。这里不再赘述。","link":"/2021/08/19/%E8%A7%A3%E5%86%B3%E5%B9%BB16%E7%9D%A1%E7%9C%A0%E8%87%AA%E5%8A%A8%E5%94%A4%E9%86%92%E9%97%AE%E9%A2%98%E4%B8%8E%E7%94%B5%E6%BA%90%E7%AE%A1%E7%90%86%E9%85%8D%E7%BD%AE/"},{"title":"HP Envy-13 ad024TU黑苹果安装总结","text":"请先了解以下内容本文主要介绍在完成黑苹果的基本安装以后的完善过程。对于黑苹果完全没有概念的朋友，请看这篇文章。而本文是在很早的时候开始写的，并在原基础上不断增添了内容。那时候作者还未对EFI做足够的优化，因此本文在现在看来有一些过时。假如你遇到了文章中出现的类似情况，希望可以给你提供一些解决思路。但是一般来说，如果你的机型和硬件与我的相同且使用了我提供的EFI的话，基本安装完成以后机器就已经是几乎完美的一个状态了，只需要做很少的优化即可。 作者电脑的EFI存放于这个Github仓库中：HackintoshForEnvy13-ad0xx。 作者电脑型号为HP Envy-13 ad024TU，其中部分文件不建议大家直接用于其他型号的电脑。若使用本仓库中文件导致系统故障或崩溃，作者本人概不负责。 作者电脑的网卡和硬盘均作了更换。故即使机型相同，直接套用此EFI依旧可能会产生问题，请知照！ 此EFI一开始是来自于交流群中来源不明的Envy-13通用EFI，里面的内容杂乱无章而且有很多不必要的驱动和补丁，但还是可以将机器驱动起来。经过大半年的维护，我对其中的内容作了一些精简，但是其中的方法依旧相对落后和杂乱。现在的这个EFI基本上是基于SlientSliver的HP-ENVY13-ad1XX-Hackintosh修改而来，保留了其中的hotpatch部分，更改了一些驱动和补丁。特此鸣谢！ 关于本机的功能： CPU：可以正常变频 电源：节能五项似乎没有完全加载，但是电池电量显示正常，使用上没有障碍 显卡：仿冒的Intel HD Graphics 520，ig-platform-id为0x19160000，驱动原生显卡Intel HD Graphics 620会产生非常诡异的色阶断层，严重影响观感 睡眠：正常，以前曾有过睡眠唤醒掉蓝牙的问题，现在已经解决 声音：使用的LayoutID为03，只能驱动底面的扬声器，对于这款笔记本电脑来说，两个扬声器和四个扬声器听起来并无什么差别，对音质有追求的请直接外接蓝牙音响或者使用耳机，插入耳机后音量可以自动调节为之前的设置值 网卡和蓝牙：原配网卡无法使用，我更换为DW1560，没有故障出现，Airdrop，HandOff，Sidecar都可以正常使用，可以连接AirPods听音乐并且功能完整 触控板：加载了白苹果手势，但除了四指手势和力度感应之外其他手势都可以用 亮度调节：可调，但是档位间隔不大，最低档位的时候屏幕还是较亮 USB接口：四个接口均可正常使用 摄像头：可用 读卡器：无法驱动，有需要的建议使用读卡器 声明：仓库中所有文件均可供个人用途和技术交流使用，在转载时请务必标明出处。不得将此仓库中的任何文件用于任何商业活动！ 基本安装过程中的一些问题这部分不是主要内容，但还是讲两句吧。 进入不了安装界面： 首先请确认你安装镜像中的EFI是适用于你的电脑型号的。如果还是不行，请在Clover中的Option选项中选择-v以啰嗦模式启动，这样启动的时候会显示出详细的信息。将最后出现的报错信息拍下来或者整个启动过程录制下来以后，找网友求助吧。 安装macOS 10.15的过程中，在啰嗦模式中出现如下图所示报错： ​ 请在Clover中打上如图所示的这个补丁。 进入安装界面且开始安装一段时间后，无法继续安装： 请重新下载镜像，在下载完成以后检查镜像的md5值是否正确。如正确，再制作你的镜像U盘。 对于10.14.x的镜像进入安装界面后提示应用已经损坏，无法安装： 请将你的bios时间往前调整至2019年10月25日以前，但是不要调整得太久远。这是因为旧的镜像中的证书会在上述时间以后过期导致无法安装。 后续完善中的一些问题在安装完成以后，便可以进入系统了。但是这个时候的系统还是非常不完善的，需要做很多调整。进入系统后，先在 关于本机-系统报告中检查各个硬件项目是否被成功驱动，然后再根据没有成功驱动的项目，安装相对应的驱动或者打必要的补丁。但是前文说过：如果你的机型和硬件与我的相同且使用了我提供的EFI的话，基本安装完成以后机器就已经是几乎完美的一个状态了，只需要做很少的优化即可。 如果使用的是与作者相同型号的电脑（型号完全一致，且未更换过任何硬件），以下项目是有故障的 网卡未被驱动，无法上网 蓝牙未驱动，无法使用蓝牙 Siri, iMessage, FaceTime, HandOff无法使用 以下项目有可能出现故障： 声卡未驱动，没有声音，也无法录音 无法调节显示器亮度，在系统偏好设置中也没有调节亮度的拖动条 触控板未被驱动，无法使用触控板 因此，仅仅完成了系统的安装是远远不够的。此时我们的电脑还无法被称为生产力工具。下面就介绍一些解决故障的办法以及系统优化的办法。 首先应当获取软件安装权限，只有在此以后你才可以安装非App Store下载的，或者由非受信任的开发者开发的软件： 在终端中输入：sudo spctl --master-disable 建议安装的软件： Clover Configurator：用于修改Clover的配置文件config.plist Hackintool：功能强大的黑苹果配置工具 Kext Utility：用于重建缓存 CPU-S：用于测试CPU变频档位 MaciASL：用于修改SSDT 这些软件可以通过这个百度云链接下载。密码：57qf。 机型选择： 使用Clover Configurator打开config.plist，确保在机型设置中选择MacBook Pro 14,1。关于机型的选择，原则上是需要将你的电脑的集成显卡的型号与所选机型的集成显卡型号对应起来的，否则无法驱动你的显卡。具体的选择参见：黑苹果必备：Intel核显platform ID整理及smbios速查表。 驱动的正确安装方法： 如果驱动没有正确安装，有极大的可能性会导致重启之后无法进入系统。作者本人就在这个问题上吃了很大的亏。关于驱动的安装，分为两种情况。 操作的是/EFI/CLOVER/kexts/Other中的驱动文件。对于这种情况，不需要重建缓存。 操作的是/Library/Extensions或者/System/Library/Extensions中的驱动文件。如果操作的是这个两个文件夹中的驱动文件，则需要重建缓存。可以通过Kext Utility软件或者使用终端命令行来重建缓存。 重建缓存的命令：sudo kextcache -i /。 关于网络： 对于使用安装了Intel（或者其他某些品牌）的网卡的电脑的朋友们，进入黑苹果系统以后网卡是没有驱动的，也就是说这个时候电脑是没有办法上网的。若是电脑安装了某些型号的免驱网卡，在macOS系统下电脑就可以直接连接网络。一般来说，如果不想拆机，可以使用USB网卡。但是使用USB网卡无法使用Siri, iMessage, FaceTime, HandOff等功能。 对于Intel的网卡，目前在macOS下是没有很好的办法驱动的。但是情况也在发生着一些改变。最近远景论坛已经有大佬写出了Intel网卡的驱动，但是还是存在一些问题。有兴趣的可以看看他的GitHub项目里面有没有支持你的网卡的型号：IntelBluetoothFirmware。 对于网络的问题，可以使用USB网卡。或者直接将电脑的网卡拆下并更换为可以使用的免驱网卡。关于免驱网卡型号的选择，可以参考这个网站：黑苹果建议的无线网卡 Hackintosh Compatible WiFi(20190505增加无线路由器推荐)。 当安装了合适的网卡以后，电脑便可以上网了。这个时候，这台电脑才基本可以投入使用。 关于BCM94352Z(DW1560)： 作者使用的就是这种无线网卡。这个网卡是Wi-Fi和蓝牙二合一无线网卡。该网卡的无线局域网功能在macOS和Windows系统下都是免驱的。但是这个网卡在macOS下要驱动蓝牙需要三个驱动文件，分别为：AirportBrcmFixup.kext，BrcmFirmwareData.kext，BrcmPatchRAM3.kext。将这些驱动文件放入/EFI/CLOVER/kexts/Other下。注意，该目录下还应当存在Lilu.kext，否则驱动文件无法正常工作（仓库中提供的EFI文件夹中都已包含这些驱动文件了）。 作者的电脑一度出现了电脑睡眠唤醒后蓝牙失效的情况，并被这个问题困扰了很久。一开始是参考了Broadcom BCM94352z/DW1560驱动新姿势[新方法]中的方法，但是问题并没有得到根本解决。之后在/EFI/CLOVER/kexts/Other中加入了ACPIDebug.kext，将电脑hibernatemode的值调整为0，并在蓝牙偏好设置-高级选项中取消勾选允许蓝牙设备唤醒这台电脑后，也没有解决该问题。然后作者尝试重新订制USB驱动来解决这个问题，但是还是没有能够解决这个问题。 最后，作者更换了最新的蓝牙驱动，才最终完美解决了这个问题。需要注意的是，有时在睡眠唤醒之后，蓝牙图标会短暂的显示为失效状态，然后回复正常。 在Windows系统下，可以自行安装驱动人生软件来安装蓝牙的驱动。 目前市面上DW1560的价格在300元左右。实话说，这个价格完全是因为黑苹果这边的需求炒起来的。而同时社区中也有其他网卡的解决方案，除了上文所提到过的驱动还开发中的部分Intel网卡之外，DW1820是另一个价格相对低廉的选择。但是根据社区中的反馈，DW1820的表现并不是特别稳定，有可能会出现各种奇怪的问题。因此，作者建议还是直接购买DW1560比较好，一步到位，省了各种折腾和闹心。另外，你也可以购买Mac上的拆机网卡或者DW1830，后者的价格在500元左右，速度比DW1560更快。 关于睡眠： 请打开Hackintool软件，并切换到电源一栏。再点击红框中的按钮，使得电源信息中红色的两行变为绿色。此操作可能可以解决一些睡眠问题。 定制USB驱动： 定制USB驱动有可能可以帮助解决一些睡眠上的问题，其操作步骤也十分简单，所以博主强烈推荐大家还是定制一下。在此处附上订制USB驱动的教程：Hackintool(Intel FB Patcher) USB定制视频。需要注意的是，你有可能发现在使用了USBInjectALL.kext以后仍有端口无法加载/检测不到。你可以尝试在Clover的config.plist中添加下列解除USB端口数量限制补丁来解决这个问题。 123456789Comment: USB port limit patch #1 10.15.x modify by DalianSky(credit ydeng)Name: com.apple.iokit.IOUSBHostFamilyFind: 83FB0F0FReplace: 83FB3F0FComment: USB Port limit patch #2 10.15.x modify by DalianSkyName: com.apple.driver.usb.AppleUSBXHCIFind: 83F90F0FReplace: 83F93F0F 开启HiDPI使屏幕看起来清晰： 在终端中输入：sh -c &quot;$(curl -fsSL https://raw.githubusercontent.com/xzhih/one-key-hidpi/master/hidpi-zh.sh)&quot;，再按提示操作即可。 详情请见：HiDPI是什么？以及黑苹果如何开启HiDPI。 打开SSD Trim： 在终端中输入：sudo trimforce enable，然后输入y再回车，重复一次，电脑将自动重启。需要注意的是，使用原装SSD的朋友请不要打开这个功能，这会导致你的电脑在macOS下非常卡顿，几乎无法操作。 电脑卡顿的解决办法： 在刚安装完黑苹果后，系统大概率会出现极为卡顿的情况。这种卡顿主要表现在：鼠标移动卡顿、动画严重掉帧、开机速度以及应用打开速度很慢、系统资源大量占用、电脑发热严重、无法正常关机。这些问题有的时候不太明显，有的时候则令电脑根本无法使用。上述问题有时在让电脑睡眠一段时间之后重新唤醒即可得到改善，但是无法根本解决。 出现上述问题的根本原因就在于本型号电脑所使用的SSD——Intel SSDPEKKF360G7H对macOS的兼容并不好。若要正常使用该SSD的话必须在/EFI/CLOVER/kexts/Other中添加HackrNVMeFamily.kext。你可以在GitHub仓库文件主目录下的kext文件夹中找到这个驱动。在添加了这个驱动之后，系统的卡顿现象可以得到非常明显的改善，基本上做到了流畅运行，但是偶尔还是会有些许卡顿。 解决这个问题最根本的方法还是更换SSD。作者的SSD已经更换为西部数据的SN500，故在EFI文件夹中删除了这个驱动文件。 电脑无法调节屏幕亮度的解决办法： 一般情况下不会出现这样的情况，但是如果发生了，使用Kext Utility重建缓存后重启即可。 关于本机的VoodooPS2Controller.kext： 在更换了EFI的hotpatch方法以后，最新版本的VoodooPS2Controller.kext已经可以正常使用。注意，新版本的VoodooPS2Controller.kext需要配合VoodooInput.kext使用。下面所说的定制VoodooPS2Controller.kext的内容已经过时，但此处仍加以保留，你可以根据自己的喜好按需使用。 旧版本的VoodooPS2Controller.kext存放于GitHub仓库文件主目录下的kext文件夹中，它双指手势只支持上下左右滑动，三指手势在修改后实现了下表所述功能。它与新版驱动相比，优点在于：十分稳定，三指手势的识别成功率几乎达到100%，并且双指轻触十分灵敏。 为迎合macOS调度中心默认的键位，我将该驱动的三只滑动手势的键盘映射作了些许调整，其对应关系如下表： 手势 原本对应的快捷键 修改后的快捷键 功能 三指上滑 ⌘+ˆ+↑ ˆ+↑ 调度中心 三指下滑 ⌘+ˆ+↓ ˆ+↓ App Exposé 三指左滑 ⌘+ˆ+← ˆ+→ 向右切换一个全屏页面 三指右滑 ⌘+ˆ+→ ˆ+← 向左切换一个全屏页面 触控板没有反应的情况： 一开始我以为是相关驱动没有成功加载的缘故，但是后来发现这是因为触控板被误锁定了。按下电脑键盘右上角的prt sc键可以锁定/解锁触控板。 关于CPUFriend.kext： 该驱动文件用于实现CPU的变频功能。由于该驱动程序只能根据用户个人的电脑定制，所以请不要直接使用仓库EFi文件夹中所提供的驱动文件。具体安装方法参见：利用CPUFriend.kext实现变频。 安装完成后，可以使用CPU-S来检测自己电脑的变频档位。 打开原生的NTFS读写功能： 该操作有一定风险，是否需要开启请自行判断。 在macOS的默认状态下，NTFS格式的磁盘是只能读不能写的。但是我们可以将隐藏的功能打开，从而可以对该格式的磁盘进行写操作，详情参考这个链接：macOS打开原生的NTFS读写功能。 如果你对NTFS格式的磁盘读写功能有刚需，也有很多相关的软件可供选择。此处略去不表。 修复Windows和macOS下时钟不同步的问题： 对于安装了双系统的电脑，在从macOS切换回Windows之后会发现Windows的系统时间与当前时间不符。解决这个问题的办法是：在Windows下，打开CMD输入下面的命令后回车。 Reg add HKLM\\SYSTEM\\CurrentControlSet\\Control\\TimeZoneInformation /v RealTimeIsUniversal /t REG_DWORD /d 1。 关于显卡platform-id的选择： 本机的显卡就是Intel HD Graphics 620，是属于7代Kaby Lake平台的，其platform-id为0x5916000，对应机型为MacbookPro 14,2。但是经过本人实践发现，如果注入的是HD 620的id，系统显示器输出的帧缓冲深度(Framebuffer depth)为诡异的30位，这对应的是10位的显示器。由于电脑显示器本身为8位的，因此10位的颜色输出会导致高斯模糊和半透明的画面出现严重的色阶断层（色带）。一开始我以为是显示器EDID不匹配的问题，但是经过搜索发现，在Kaby Lake平台上，这个问题是因为显卡platform-id选择得不对，应该是需要仿冒6代Sky Lake平台的Intel HD Graphics 520才可以得到正确的24位的帧缓冲深度输出，如下图所示。 关于这个问题的具体内容和解决方法可以参看这个网页。 至此，黑苹果的安装和完善就差不多结束了。现在可以登陆iCloud以及其他苹果服务，并安装自己需要的软件了。 附：博主电脑配置 型号 HP Envy-13 ad024TU CPU Intel Core i7-7500U(2.7GHz) RAM 8GB DDR4 显卡 Intel HD Graphics 620 硬盘 Intel SSDPEKKF360G7H 360G （已更换为WD SN500） 网卡 Intel 7265NGW（已更换为DW1560） 声卡 ALC295 📌 Note 目前，Open Core已经成为黑苹果社区使用的主流引导，博主同样将黑苹果迁移到了OC上面，有需要的话可以下载这个仓库中提供的EFI文件。此外，更换电脑之后我不打算再折腾黑苹果了，于Github上存放EFI的仓库将不再更新。","link":"/2020/02/14/HP_Envy-13_ad024TU_Hackintosh/"},{"title":"Hexo博客的安装和自动部署","text":"在2020年年初Astroblog搭建完成的时候，我就打算记录下当时整个服务器搭建和博客的部署过程。这个过程我打算分为三篇文章来水，分别是服务器搭建、Hexo安装与自动部署、博客主题Icarus的自定义。后来由于种种原因，只写完了三篇文章中的第一篇，剩下两篇拖更到现在。前段时间刚好换了电脑，由于当时部署博客的很多细节都不记得了，迁移的过程尤其痛苦，踩了各种坑之后才终于搞定。于是趁热打铁，赶紧把这两个坑填了，权当备忘。 关于HexoHexo是一个高效、简洁的博客框架。它基于Node.js，通过几条命令就可以由Markdown文件快速生成静态的HTML网页。静态网站具有轻量、速度快等特点。它的部署非常方便灵活，不但可以部署在服务器上，还可以部署在静态托管网站上，比如Github Pages。本文主要讨论如何将Hexo部署在服务器上。 首先来认识一下Hexo项目中有什么文件： 12345678910.├── _config.yml #Hexo的配置文件├── db.json #Hexo自动生成的文件├── package.json #插件配置文件，下同├── package-lock.json ├── node_modules #生成网站需要用到的Node.js模块├── scaffolds #存放模板的文件夹├── source #博客Markdown源文件夹├── public #存放生成的静态HTML文件└── themes #主题文件夹 一般来说，Hexo部署的过程是这样的： 在本地编辑Markdown文件并通过Hexo生成静态网页，存放于./public文件夹中 将./public文件夹中的文件复制到远程服务器上 设置服务器访问的网址为博客首页 你同样可以在服务器上配置Hexo环境，将Markdown源文件上传到服务器上编译。不过一般还是推荐在本地编译，这样比较方便，并且还可以预览生成的博客。 下面开始介绍Hexo博客安装和部署的具体操作。 Windows系统下Hexo的安装与部署安装相关依赖Hexo是基于Node.js来生成网页的，那么首先就要安装Node.js。Windows用户清前往Node.js官方下载地址下载最新版本的.msi格式的安装包，下载之后打开安装包直接安装即可。安装程序可能会询问你是否自动安装必要的工具，这里没有必要勾选这个选项。 一般来说安装最新版本的Node.js就可以了。但是作者在迁移博客的过程中发现，由于没有更新Hexo至最新版本，使用最新版本的Node.js会导致编译生成的网页全是空白的，所以作者最后还是使用了v12.22.5版本的Node.js。有需要的朋友可以在这里下载到历史版本。 安装Hexo并撰写博客根据Hexo官方提供的安装方法，安装过程需要使用npm包管理工具。新版本的Node.js已经集成了npm，所以打开Powershell终端直接按顺序输入下面的命令行进行安装即可： 12345npm install hexo-cli -g #安装hexocd &lt;dir&gt; #进入选定的博客存放目录hexo init #在当前目录初始化博客hexo g #生成博客文件hexo s #在本地浏览器预览你的博客 如果你看到终端输出了类似下面的信息，恭喜你，你的博客已经构建成功了！你可以在浏览器中访问http://localhost:4000来预览你的博客。 你可以使用./scafflods/post.md作为模板创建你的第一篇博客。使用编辑器打开这个文件，可以模仿下面的内容来编写你的文章。模板中三根横线之间的内容是yaml文件头，并不使用Markdown语法，需要注意。 1234567891011---title: Hello World! #标题date: 2021-8-17 18:30:00 #按格式填写博文创建的日期tags: #按照下面的格式添加博文的标签 - demo - hello #在横线下面开始编辑你的博客正文---Hello World!你好，世界！ 写完以后，将这个文件放入./source/_posts文件夹中，该文件夹中的Markdown文件会被编译生成网页。而存放在./source/_drafts文件夹中的文件则只是草稿，并不会在网页中出现。 最后，在你的博客目录下，再次执行hexo g和hexo s两条命令，你编辑的第一篇博客便可以以网页的形式在浏览器中预览了。另外，你还可以通过hexo clean命令来清除之前生成的HTML网页。 在服务器上部署Hexo在本地生成了博客网页以后还不够，只有我们将./public中的HTML文件上传到服务器之后，其他人才能通过互联网浏览我们的博客。 你可以使用命令行或者FTP客户端来将你的博客上传到服务器上的指定文件夹。由于作者不擅长使用命令行，所以还是使用了FileZilla这个有图形化界面的FTP软件来完成这个工作。 最后，你需要将你的服务器的IP地址或者域名定向到你博客的首页。这里以nginx为例简单说说配置方法。 在nginx的配置文件中的server-location项中，将index的值修改为博客首页的HTML文件，也即&lt;dir&gt;/public/intex.html，其中&lt;dir&gt;为你在服务器上存放博客pubic文件夹的目录。 保存文件并重启nginx服务后，你应该便可以通过你的服务器的IP地址或者域名来访问你的博客了！ 配置博客自动部署功能通过上面的方法，可以完成博客的编辑和部署工作。但是每次编辑完成以后，部署工作显得复杂繁琐。有没有一种办法，能够在完成博客的编辑以后，通过简单的操作就可以将博客部署到服务器上呢？答案是有的。我想实现的效果大概是这样： 完成Markdown的编辑以后，直接上传./source/_posts文件夹中的源文件 通过某种方式自动生成HTML文件并将其拷贝到服务器上 这样我们就不需要每次都进行复杂的部署，并且可以专注于写作本身。 下面具体来讲一下怎么实现这个目标。 什么是持续集成？想要实现博客的自动化部署，就必须引入持续集成这个概念。 持续集成（Continuous Integration, CI）指的是，频繁地（一天多次）将代码集成到主干。持续集成可以使产品快速迭代，同时保证质量。——持续集成是什么？ - 阮一峰的网络日志 一般来说，持续集成可以让人们快速发现错误。在持续集成之后，随之而来的是持续交付和持续部署。持续交付指的是频繁地将软件提交给质量团队或者用户进行评审，如果评审通过，那么久将软件自动部署到生产环境中。我们通常说的持续集成，同时包括了上面三个过程。 对于个人博客而言，持续集成和持续交付通常是一体的，也就是我们编辑博客内容的过程。而现在我们需要实现的就是持续部署的功能，即将自己的博客源文件自动生成网页并部署到服务器上。 实现持续集成，就必须使用相应的工具。目前市面上的主流持续集成工具有：Jenkins、Travis CI、Gitlab CI等。在这里我们使用Github + Travis CI的组合来实现持续集成的功能。 Travis CI是一个依赖于Github的持续集成工具，它从Github的代码仓库中拉取代码。它在检测到仓库文件有更改之后，会在远程自动创建一个虚拟机，然后根据你的Travis CI配置文件编译你仓库中的代码并执行其他一些操作。 需要注意的是，Travis CI的官方网址现在变为travis-ci.com而非travis-ci.org。后者现在是只读模式，请务必注意。 Github授权并生成Token使用Travis CI首先就要对其授权使其可以访问自己的Github仓库。 进入Travis CI的官网后直接用Github账号登录，根据提示开通Travis CI对仓库的访问授权。你可以选择允许访问所有仓库，也可以指定部分仓库以供访问。 在自动部署的过程中，Travis CI需要通过命令对Github的仓库进行修改操作，这就需要我们登录Github服务。但是在登录的过程中，将自己的密码直接暴露出去是很危险的。所以，这里使用Token（令牌）来代替密码，以增强安全性。 关于生成Github Token的方法，请看创建个人访问令牌 - GitHub Docs。 请妥善保存生成的Token。 使用Travis CI进行持续集成配置ssh免密登录服务器自动部署必然会对服务器端的文件进行操作，因此必须远程登录服务器。但是部署过程是由Travis CI自动完成的，我们也无法在Travis CI的控制台中输入服务器的登录密码。因此我们还要能够免密登录服务器。 免密登录是基于密钥对来实现的。密钥对分为私钥和公钥，私钥以明文形式存储，由我们自己保存，千万不可泄露。而公钥由私钥加密而来，在进行ssh免密登录时，在网络中由本地传送到服务器的就是公钥。本地电脑和服务器经过一系列操作后比对生成的校验值，如果校验通过便可以登录到服务器。 ssh免密登录的具体原理可以参考下图（来源：图解SSH原理 - 简书 (jianshu.com)）。 接下来讲讲实现方法。 在Powershell中输入：ssh-keygen -t rsa。 之后会提示你输入秘钥的名字，如果直接按回车跳过则会使用默认的文件名id_rsa。 接着会让你输入并确定需要加密的密码，这里我们直接跳过。 然后我们就可以在C:/Users/&lt;你的用户名&gt;/.ssh中看到新创建的两个文件，其中id_rsa为私钥，id_rsa.pub为公钥。 在刚才的那个文件夹中创建文件config，不需要后缀名。其内容如下： 12345678910# 远程主机名称Host &lt;你的服务器域名或ip地址&gt;# 远程主机域名或者 ip 地址HostName &lt;你的服务器域名或ip地址&gt;# 认证方式PreferredAuthentications publickey# 私钥位置IdentityFile C:/Users/&lt;你的用户名&gt;/.ssh/id_rsa# 用户名User root 将公钥复制一份，重命名为authorized_keys。然后将id_rsa.pub和authorized_keys上传到服务器的~/.ssh文件夹中。 在终端里输入：ssh root@&lt;你的服务器域名或ip地址&gt;。如果不需要密码就可以登录的话，那就说明ssh免密登录设置成功了。 如果在完成了上面的步骤之后在登录服务器时仍然需要输入密码，或者出现了类似下面的报错： Permission denied (publickey,gssapi-keyex,gssapi-with-mic). 那么请尝试执行下面三条命令，更改服务器上~/.ssh文件夹的权限。 123chmod 700 ~/.ssh/chmod 700 /home/userNamechmod 600 ~/.ssh/authorized_keys 配置Travis Ci在博客的的根目录下面创建Travis CI的配置文件.travis.yml，并且将下面模板的内容添加到文件中。 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950#设置构建环境为Node.jslanguage: node_js #选择Node.js版本，我这里由于没有更新Hexo，所以使用了较老的版本，该项值一般为&quot;stable&quot;node_js: 12.22.5 #设置需要编译的代码分支，Travis CI只检测当前分支的变动，请根据自己的实际情况修改branches: only: - hexo#在每次构建之前需要先配好环境before_install:#配置Travis CI免密登录服务器- openssl aes-256-cbc -K $encrypted_&lt;key&gt;_key -iv $encrypted_&lt;iv&gt;_iv -in &lt;id_rsa.enc&gt; -out ~/.ssh/id_rsa -d- chmod 600 ~/.ssh/id_rsa- eval $(ssh-agent)- ssh-add ~/.ssh/id_rsa- cp ./ssh_config ~/.ssh/config#配置Github信息以使Travis CI可以更改仓库- git config --global user.name &quot;$GIT_NAME&quot;- git config --global user.email &quot;$GIT_EMAIL&quot;#安装Hexo- npm install -g hexo-cli#安装package.json中的插件install:- npm install#生成网页script:- hexo clean- hexo generate#生成成功之后需要执行的操作（部署）after_success:#将./public文件夹中的网页复制到服务器上的指定位置- scp -o stricthostkeychecking=no -r ./public/* root@&lt;你的域名或IP&gt;:&lt;博客网页存放的路径&gt;#在Travis CI上切换到你的博客的./public文件夹，在该路径下初始化git，以&quot;Travis CI Auto Builder&quot;的名称提交代码并推送到&quot;master&quot;分支上- cd ./public- git init- git add --all .- git commit -m &quot;Travis CI Auto Builder&quot;- git push --quiet --force https://$GIT_TOKEN@&lt;你博客的Github仓库网址&gt; master #配置已知的主机，以保证可以成功登陆addons: ssh_known_hosts: - &lt;你的域名或IP&gt; 观察上面的文件可以发现，其中以$开头的变量一共出现了五次。在Travis CI的配置文件中，这些变量为环境变量，它们的值不以明文的形式出现在配置文件中，需要你自己在Travis CI的网页上设置值。 在Travis CI的网页中找到你的博客的仓库。点击右上角的More options按钮后再点击Settings进入设置页面。 在设置页面中，必须要打开General栏中的Build pushed branches。否则即使你推送了代码，Travis CI不会自动构建项目。 然后在Environment Variables一栏中的空白文本框处，分别填写你的环境变量的名称NAME和值VALUE，然后点击Add按钮以添加。在这一小节，我们需要添加三个环境变量： Name Value GIT_EMAIL &lt;填写你Github绑定的邮箱&gt; GIT_NAME &lt;填写你Github的账户名&gt; GIT_TOKEN &lt;填写你在上一节中生成的Github Token&gt; 文件加密接下来讲讲Travis CI免密登录服务器的配置以及最后剩下的两个环境变量。 类比之前设置本地ssh免密登录服务器的方法，要想让Travis CI生成的虚拟机可以免密登录服务器，其必须要有公钥id_rsa.pub、私钥id_rsa、以及配置文件config。但是直接将私钥以明文形式上传太危险了。Travis CI提供了加密服务，可以将私钥加密以后上传到它的服务器，再在其虚拟机上解密生成私钥。这样一来，Travis CI就可以安全地进行ssh免密登录了。 接下来的加密操作建议在Linux或者macOS下进行，在Windows 10上操作有可能会产生bad decrypt的错误。（参见：File decryption fails (wrong final block length) on Windows · Issue #4746 · travis-ci/travis-ci (github.com)） 在加密操作之前，请先确认你的电脑上是否安装有ruby，否则无法使用gem包管理工具。 执行下面的命令以安装Travis：gem install travis。 登录Travis：travis login --github-token &lt;token&gt; --pro。注意这里必须加上后缀--pro，否则这个命令默认登录的是https://api.travis-ci.org而非https://api.travis-ci.com。 在存放有你的私钥id_rsa以及.travis.yml的目录下执行：travis encrypt-file id_rsa --add --pro。如果这个目录不是你存放博客的Github仓库的本地文件夹，那么请按照给出的提示添加后缀。 执行完毕后，在该文件夹下会新增一个id_rsa.enc文件。这个文件就是经过加密后的私钥了。检查.travis.yml文件，会发现其中多了一行类似于下面的代码： 1- openssl aes-256-cbc -K $encrypted_&lt;key&gt;_key -iv $encrypted_&lt;iv&gt;_iv -in id_rsa.enc -out id_rsa -d 上面&lt;key&gt;和&lt;iv&gt;的值是随机生成的数字和字母的组合，该命令的作用在于解密id_rsa.enc以得到私钥id_rsa。-in表示输入文件，-out表示解密后的文件，我们将其路径修改为~/.ssh/id_rsa，可以得到： 12- openssl aes-256-cbc -K $encrypted_&lt;key&gt;_key -iv $encrypted_&lt;iv&gt;_iv -in &lt;id_rsa.enc&gt; -out ~/.ssh/id_rsa -d 此外，在Travis CI对应仓库的设置中，还会新增两个环境变量encrypted_&lt;key&gt;_key与encrypted_&lt;iv&gt;_iv。 在得到私钥后，我们还要进行下面的操作以使Travis CI可以免密登录服务器。 在.travis.yml中按照模板的格式添加以下代码： 1234- chmod 600 ~/.ssh/id_rsa- eval $(ssh-agent)- ssh-add ~/.ssh/id_rsa- cp ./ssh_config ~/.ssh/config 然后，将id_rsa.enc移入你的博客的根目录下，并切记删除你在博客目录下的私钥！。 在博客根目录下新建文件ssh_config，将下面的内容复制进去并保存。我们需要它来配置Travis CI上的ssh登录过程。 12345Host * User git StrictHostKeyChecking no IdentityFile ~/.ssh/id_rsa IdentitiesOnly yes 到这里，所有的配置工作就完成了！ 最终实现的效果经过上面的一系列复杂操作，我们最终实现了博客的持续集成，其工作流如下： 在本地编辑Markdown文件 编辑完成后直接推送到Github的目标分支上 Travis CI检测到指定分支上文件的更改 Travis CI创建虚拟机并依据配置文件生成博客网页文件 Travis CI将生成的网页复制到服务器的指定位置，完成部署 在部署的过程中，只有第二步是需要我们进行操作的，其他的工作全部由Travis CI自动完成了，非常的方便。 点击Travis CI对应仓库标题右侧的绿色图标可以将其以Markdown格式添加到你的Github仓库的readme.md文件中。如果Travis CI操作的分支不是默认分支，那么这个图标将只显示unknown的状态。 参考： 使用 Travis 打造 SpringBoot 应用持续集成和自动部署 | Travis CI 初体验 (juejin.cn) 基于 Hexo 的全自动博客构建部署系统 - KChen’s Blog","link":"/2021/08/16/Hexo%E7%9A%84%E5%AE%89%E8%A3%85%E5%92%8C%E8%87%AA%E5%8A%A8%E9%83%A8%E7%BD%B2/"},{"title":"华为云+nginx服务器搭建总结","text":"由于自己是去年七月配置好的服务器，有一些细节或者遇到的问题已经记不太清，故本文可能会有不完整的地方，遇到问题请善用搜索引擎，而且服务器的配置方法也不只有这一种。本文主要用作对自己操作步骤和方法的一个总结，以便于日后查阅。 购买服务器首先去华为云官网注册一个账号。如果是学生，可以搜索“学生”，并进行学生认证。学生认证的步骤参见学生认证流程。进行身份验证后可以购买学生优惠套餐，云服务器价格只要99元/年，比阿里云和腾讯云的都要便宜一些。 购买完成后，你可以在控制台看到自己现有的资源以及运行情况。 配置安全组 安全组是一个逻辑上的分组，为具有相同安全保护需求并相互信任的云服务器提供访问策略。安全组创建后，用户可以在安全组中定义各种访问规则，当云服务器加入该安全组后，即受到这些访问规则的保护。 系统会为每个用户默认创建一个默认安全组，默认安全组的规则是在出方向上的数据报文全部放行，入方向访问受限，安全组内的云服务器无需添加规则即可互相访问。默认安全组可以直接使用。 安全组创建后，你可以在安全组中设置出方向、入方向规则，这些规则会对安全组内部的云服务器出入方向网络流量进行访问控制，当云服务器加入该安全组后，即受到这些访问规则的保护。^1 在控制台点击“弹性云服务器ECS”，在这里你可看到你的服务器的公网IP，请记下这个IP地址。然后点击在列表中点击你的服务器的名称。 进入云服务器管理页面后，点击“安全组”。再点击“Sys-default”可以看到默认安全组。然后下面给出的图片是我目前的安全组设置，仅供参考。选择“入/出方向方向规则”，再点击“添加规则“即可手动添加规则。一般来说，配置的都是入方向的安全组，并且源地址（访问服务器的设备的IP地址）都为“0.0.0.0/0”（所有IP地址）。 通常需要配置如下几个功能： SSH远程连接Linux弹性云服务器（协议：SSH，端口：22） 公网“ping”ECS弹性云服务器（协议：ICMP，端口：全部） 弹性云服务器作Web服务器 协议：http，端口：80 协议：https，端口：433 详细配置请参考安全组配置示例。 配置完成后，可以打开电脑上的终端，用下面的语句测试一下： ping 你的公网IP 出现类似下面的内容就代表成功了： 你可以按下Ctrl+C来结束ping这个进程。 然后在终端里输入： ssh 你的公网IP 如果你的安全组配置正确的话，会让你输入服务器的登录密码。输入密码（注意：密码是不会显示的）后回车，应该可以看到这样的输出： 这个时候，你的终端就已经连接上了服务器的系统了，你在终端里的一切操作都是作用在服务器上的。 在服务器上安装nginx首先请在终端使用ssh登录你的服务器，然后按照下面给出的顺序输入命令。 12345678910yum -y install gcc zlib zlib-devel pcre-devel openssl openssl-devel #安装编译工具及库文件cd /usr/local/ #切换到目标安装文件夹wget http://nginx.org/download/nginx-1.16.1.tar.gz #下载最新版本的Nginxtar -zxvf nginx-1.16.1.tar.gz #解压文件cd nginx-1.16.1 #进入解压的文件夹./configure #执行程序make #编译make install #安装cd /usr/local/nginx/sbin #进入Nginx安装目录./nginx #运行Nginx 此时，安装应该已经完成了。打开浏览器，在地址栏中输入你的公网ip。如果看到下图所示内容，就代表安装成功了。 创建属于你自己的域名在拥有了自己的服务器以后，就可以做很多事情了。但是现在你只能通过IP地址访问自己的服务器，看起来总是有点别扭。另外，如果你想要网站有一定的影响力的话，仅有IP地址会让人几乎找不到你的网站，而且也不符合国家法律规定。所以还是建议大家弄一个自己的域名。 现在市面上的云服务器提供商也都提供域名注册的服务，直接在你的服务提供商的平台上面注册即可。下面我继续用华为云的平台演示。 首先在华为云网站页面的导航栏的搜索框内搜索“域名”，打开第一个链接“域名注册服务”。也可以直接点击这里：域名注册服务_华为云。 然后你可以在网页中选择你的域名，常见的如.com，.cn，.net等。这些域名会相对比较贵。作为学生党，我选择一个最便宜的域名.top，只需要9元/年。 点击你想要的域名后，会跳转到一个新的页面。接下来再次选择你要的域名，并且在“查域名”的搜索框内输入你想要的域名，看看是否已经被占用，如果被占用了就换一个。若显示“域名可注册”，就点击“立即购买”。 购买完成后，你就拥有了自己域名了！ 备案 备案是中国大陆的一项法规，使用大陆节点服务器提供互联网信息服务的用户，需要在服务器提供商处提交备案申请。 根据工信部《互联网信息服务管理办法》(国务院292号令)和工信部令第33号《非经营性互联网信息服务备案管理办法》规定，国家对经营性互联网信息服务实行许可制度，对非经营性互联网信息服务实行备案制度。未取得许可或者未履行备案手续的，不得从事互联网信息服务，否则属违法行为。通俗来讲，要开办网站必须先办理网站备案，备案成功并获取通信管理局下发的ICP备案号后才能开通访问。^2 这一步不多说了，具体步骤比较繁琐，花费的时间也比较长，需要一两周。网站上有很清晰的操作方法，请自行查阅，根据步骤操作即可。需要注意一点的是，在审核过程中可能会接到服务提供商打来的电话，不要漏接。 需要注意的是，上面的备案操作是在工信部备案的。完成了在工信部的备案以后还需要公安备案。具体操作方法也请自行查阅。 域名解析在完成一系列繁琐的备案流程以后，你的网站还不可以通过域名访问。只有把你的域名跟服务器的IP地址绑定在一起之后，并且在服务器上修改了配置文件之后才可以。 首先打开管理控制台，在控制台中选择“域名注册”。然后在下面的页面中点击“解析”。 点击你的域名，显示如下页面。这里显示的是你域名的记录集，前两个记录集应该是预置设置，不可暂停服务。你可以在这基础上添加自己的记录集。 点击页面右上角红色按钮以添加记录集。添加记录集的配置如下图所示。下图中给出的例子是添加的“A”型记录集，也即通过example.com访问网站。若需要通过www.example.com访问网站，则需要为example.com的子域名添加“A”型记录集。具体配置参见：配置网站解析_华为云。点击“确定”，完成添加。你可以通过ping 你的域名来测试你添加的记录集是否生效了。 配置nginx打开你电脑上的终端，输入命令：ssh 你的IP地址，输入你的服务器的密码。 进入你的nginx的安装目录：cd /usr/local/nginx/。 使用vim打开nginx的配置文件：vim ./conf/nginx.conf。 按I开始输入。 在最后一个大括号前插入以下内容： 123456server { listen 80; #监听端口设为 80 server_name example.com; #绑定您的域名 index index.htm index.html; #指定默认文件 root html; #指定网站根目录} 然后按esc退出编辑，再按Shift+zz保存。 输入：cd ./sbin，切换文件夹。 执行命令：nginx -s relod，重启nginx服务。 这时候再尝试用浏览器访问你的域名，应该会显示之前出现过的“Welcome to nginx ”的页面了！ 申请SSL证书SSL证书可以在数据传输的过程中对其进行加密和隐藏，可以极大地提高数据传输的安全性。拥有SSL证书的网站的请求头都是https，并且在链接旁边会出现一把小锁。但是，SSL证书并不是所有网站都必须的，这视你的需要而定。比如，微信小程序的服务器就必须要有域名和SSL证书。另外，出于信息传输的安全性方面的考虑，有SSL证书还是显得更为妥当和专业一点。 现在市面上各大云服务器提供商也都提供配套的SSL证书申请服务，一般都是提供企业级的证书，价格比较昂贵。但是同时网络上也有一些免费的SSL证书服务可以选择。下面还是以华为云的平台为例，简单说明一下如何申请SSL证书。 首先在华为云页面的导航栏的搜索框内搜索“免费证书“，然后点击亚洲诚信域名型DV单域名SSL证书–免费证书，可以看到证书的价格是0.00元。点击“立即购买”。 完成购买后请不要立即关闭页面，页面中的订单号在之后还需要用到。尔后，系统会发送”HuaweiCloud账户申请”邮件至用户邮箱，即你在华为云的注册邮箱。 点击邮件中的登录地址进入系统，并使用邮件提供的账号和初始密码进行登录。登入系统后请修改你的初始密码，然后请根据华为云中给你提供的订单号在该系统中查询你的订单。查询到你的订单以后，需要你补充一些信息，请如实填写。系统会要你填写公司信息，如果只是个人网站，那么公司名称直接填写你的名字即可，公司地址就填写你的住址。 填写完成后会进入审核阶段，系统会给你发送一封邮件。 根据邮件的提示，需要在记录集中添加新的内容。请根据前文所述方法，将邮件中的内容添加至新的记录集。填写方法如下图所示。 填写完成后，可以在本地电脑的终端里输入nslookup -querytype=txt 你的域名来测试记录集是否生效。 一般来说，记录集生效后10分钟以内证书就会颁发了。 SSL证书部署接下来我们要把SSL证书部署到我们的服务器上。 在收到的“证书颁发”的邮件的底部有一条链接，点击这条链接，进入证书管理系统。登录系统，在左侧导航栏中点击“SSL证书”，再点击“预览”，再在右侧的“信息预览”中点击“下载最新证书“。 在弹出的对话框内，选择证书格式为“PEM(适用于Nginx,SLB)”，输入你的订单密码。证书密码可以留空。 下载完成后，解压下载的压缩包，需要输入你的订单密码（如果你没有设置证书密码）。解压以后可以得到下图两个文件。 接下来，打开你的终端，按顺序输入下列命令： 123456ssh 你的公网IP #ssh登录，输入你的密码cd /usr/local/nginx #切换到nginx的安装目录mkdir ./cert #创建一个新文件夹cert用于存放你的证书exit #断开与服务器的连接scp 文件的路径/你的域名.key 你的服务器用户名@你的服务器IP地址:./cert #将.key文件上传到你的服务器的指定目录下scp 文件的路径/你的域名.crt 你的服务器用户名@你的服务器IP地址:./cert #将.crt文件上传到你的服务器的指定目录下 接下来我们需要修改nginx的配置文件。参考前文所述方法打开nginx的配置文件。先将你之前插入的内容删除或者使用#注释掉，然后在最后一个大括号前插入以下内容： 1234567891011121314151617181920212223server { listen 443 ssl; server_name example.com; #你证书绑定的域名; ssl_certificate /usr/local/nginx/cert/你的域名.crt; ssl_certificate_key /usr/local/nginx/cert/你的域名.key; ssl_session_cache shared:SSL:1m; ssl_session_timeout 5m; ssl_ciphers HIGH:!aNULL:!MD5; ssl_prefer_server_ciphers on; location / { index index.htm index.html; #指定默认文件。 root html; #指定网站根目录。 }}server { #将你的80端口重定向至433端口，即强制使用https访问 listen 80; server_name; example.com; #你的域名 rewrite ^/(.*)$ https://example.com:443/$1 permanent;} 将文件保存以后重启nginx服务。 重启以后你可能会遇到这样的问题：**unknown directive “ssl” in /usr/local/nginx/conf/nginx.conf:121**，这是因为你在安装nginx时，没有编译SSL模块。你可以在终端里按照下述步骤解决^ 3： 1234567cd ../nginx-1.16.1 #进入到nginx的源码包的目录下./configure --with-http_ssl_module #带参数执行程序make #编译cp /usr/local/nginx/sbin/nginx /usr/local/nginx/sbin/nginx_bak #备份旧的nginxcp ./objs/nginx /usr/local/nginx/sbin/ #然后将新的nginx的程序复制一份cd /usr/local/nginx/sbin/ #切换到sbin目录./nginx -s reload #重启nginx服务 如果重启成功的话，打开浏览器访问你的域名，这时候应该可以在链接旁边看到一个小锁了！","link":"/2020/01/08/%E5%8D%8E%E4%B8%BA%E4%BA%91+nginx%E6%9C%8D%E5%8A%A1%E5%99%A8%E6%90%AD%E5%BB%BA%E6%80%BB%E7%BB%93/"},{"title":"黑苹果入门完全指南","text":"关于黑苹果欢迎步入黑苹果的世界！众所周知，Mac因其独特的macOS系统在众多Windows电脑中独树一帜。macOS具有许多与Windows不同的特性和优点（当然，也有不足），而且有些软件在macOS上的优化会比Windows更好或者只支持macOS平台。这就是为什么Mac在市场上一直有着广泛的需求的根本原因——即macOS的独特性。由于苹果的封闭性策略，macOS在正常情况下只能安装在Mac上。而黑苹果的出现，给广大对macOS有需求的人们提供了一个新的选择——你再也不需要为了一个系统去购买在同等硬件或性能条件下价格更为昂贵的电脑了。 黑苹果，意思就是安装有macOS的，可以正常工作的非Mac的电脑，也可以指为非Mac的电脑安装macOS的行为，亦可以指安装在非Mac电脑上的macOS。对于这个词的确切定义还是模糊不清的，不过这不是关键所在。与黑苹果相对，白苹果的含义就非常明显了，也就是苹果的Mac或者安装在Mac上的macOS。 黑苹果的原理就是通过对电脑主板的破解和对系统的欺骗，让macOS以为这是一台Mac，再通过一系列驱动和补丁使得这台电脑可以在macOS下正常运行。需要注意的是： 将macOS安装在非Mac的电脑上是违反苹果公司的法律条款的！ 所以安装黑苹果是存在一定的法律风险的，这有可能（但是非常非常罕见）导致你的AppleID被锁死。但是一般情况下，苹果公司对这种行为都是睁一只眼闭一只眼。只是随着黑苹果数量上的日益增长，不知道什么时候会引起苹果公司的重视并对此采取措施。而在另一方面，如果你使用黑苹果来牟利的话，性质就完全不同了，你有可能会受到法律的制裁。 由于macOS从一开始就不被允许安装在非Mac的电脑上，因此安装黑苹果绝对不是一件容易的事情，它涉及到对主板的破解，对硬件的驱动，对系统的欺骗，同时也会产生很多奇奇怪怪的bug。黑苹果有很多缺点： 不完美的黑苹果相对于白苹果不那么稳定 黑苹果在硬件层面上的缺失导致很多功能无法实现，如Touch Bar，Touch ID，力度触控板等 安装黑苹果仍需要满足一定的硬件条件，某些型号的硬件在黑苹果下是无法驱动的 安装黑苹果费时费力，相当折腾 既然黑苹果有那么多缺点，并且还是非法的行为，那为什么还有那么多人在使用黑苹果并且人数还在日益增长呢？因为黑苹果与同样安装有macOS的电脑相比，还是有其优点的： 完美的黑苹果在使用体验上基本不输给Mac 黑苹果在同等硬件或性能条件下比起Mac便宜许多 黑苹果的定制性和可扩展性在某些方面比Mac强大许多 从黑苹果的优点来看，再结合实际情况，我们可以发现使用黑苹果的人群可以分为以下几类： 对macOS有刚需，但是又不想花钱/没钱买Mac的，如某些影视、音乐工作者 对macOS有刚需，但是受限于苹果封闭的生态，只能通过黑苹果的高可扩展性来满足自己对硬件的需求的特定行业从业者 对macOS没有刚需，具有反叛精神的极客，专门研究操作系统和硬件的工程师，通常这类人也有白苹果 对macOS没有刚需，只是想要体验macOS或苹果完整生态却又不想花钱/没钱购买Mac的人 而博主作为一个穷学生，就是属于最后一类的人😂。我折腾黑苹果已经有1年时间，现在自己在用的电脑是惠普的Envy-13 ad024TU，装有Windows和macOS两个系统。博主的黑苹果已经基本完美，在使用体验上已经与白苹果相差无几。关于我的黑苹果的更多信息，可以参考我的GitHub仓库，或者我的另一篇博客，在那篇博客里我主要总结了给自己的电脑安装黑苹果时踩过的一些坑。而这篇文章主要是针对笔记本电脑，让大家对黑苹果有一个初步的了解。看完这篇文章，你就基本入门黑苹果了。 黑苹果的原理以及核心黑苹果的原理在讨论这个问题以前，我们先要了解一下电脑是怎么启动的。 首先，在你按下开机键以后，电脑上电，各硬件进入了待命状态。CPU（Central Processing Unit，中央处理器）启动以后，按照其在设计时就固定好的功能送出了第一条指令，这一条指令将会使BIOS（Basic Input/Output System，基本输入输出系统）芯片中装载的程序开始执行。BIOS程序可以实现很多功能，比如系统自检，提供中断服务等。但是它最主要的功能则是将存放于硬盘引导区的操作系统引导程序（Boot loader，下文简称引导）装载入内存，再通过引导将操作系统装载进内存。 当然，现在市面上新发售的电脑大部分都已经采用了一种更新的方式来装载引导，也就是所谓的UEFI（Unified Extensible Firmware Interface，统一可扩部件接口）。UEFI作为一种较新的方案，它和BIOS的区别主要是在可扩展性方面。但是除了一些细微的差别，它在整个启动的流程上与BIOS基本相同，且最终目的都是将引导装载进内存当中。另外在开发者圈子中，BIOS和UEFI也常常被混为一谈。因此尽管现在的主流是采用更先进的UEFI，但在下面的叙述中我还是会使用BIOS的概念。这并不会给理解带来困难，只是你们需要知道这两者有些许微妙的区别即可。 也许有人会问，为什么不使用BIOS直接将操作系统装载进内存呢？首先，如果有多个操作系统，那么不同的操作系统的装载过程会有所不同。如果要让BIOS适配不同的操作系统，那么会导致它的体积过于庞大，系统过于复杂，不利于它的的稳定。其次就是，BIOS是固定在BIOS芯片中的，不方便修改。这也导致了我们难以让BIOS对不同的操作系统做适配。因此，我们需要引导来完成操作系统加载的工作。 具体而言，引导需要完成的工作主要有以下几点： 初始化其他硬件设备，为系统提供可访问的表和服务 为操作系统分配内存空间，再将它加载进内存当中 为高级计算机程序语言提供执行环境 将控制权移交给操作系统 在此之后，系统的完整的启动过程就结束了，操作系统接管了整个电脑。简而言之，电脑的启动过程可以概括为：BIOS-&gt;Bootloder-&gt;OS(操作系统)。 回到黑苹果上来。我们想要在一款非Mac的电脑上运行macOS，与我们在电脑上运行Windows的最大区别在哪儿？当然是操作系统不同啊！由于macOS与Windows是两个完全不同的操作系统，因此他们启动和加载的过程也完全不同。所以我们肯定不可以用启动Windows的那一套方法去启动macOS，而必须要有专门的适应macOS的一套启动方法（程序）。 我们想要将macOS加载到我们的内存当中，就要对当前我们的启动程序进行修改和适配。回顾上文所说的电脑的启动过程我们可以发现，BIOS是固定在芯片中的，不易修改。那么我们可以操作的部分就只有引导了。所以我们要找到合适的引导程序，使其可以将macOS正确地装载进内存，并给它提供正确的服务，让它可以与硬件正常交流，最终使它正常运行。 通过上面的一番讲解，我们可以发现，安装黑苹果的核心就是引导。而实际上，折腾黑苹果折腾的也主要就是引导。而由于白苹果的硬件，BIOS，和引导都是针对macOS开发的，所以当然不要任何的折腾，开箱即用就行（废话……）。 目前主流的可以用于在非Mac的电脑上启动macOS的引导主要有两个，分别是Clover和OpenCore（下文简称OC）。由于OC是新开发的引导，目前还在公测阶段，而且其在社区普及率远远不如Clover，所以下面将主要讲解Clover，而对于OC只作非常简单的介绍。 Clover 启动器的名字Clover由一位创建者kabyl命名。他发现了四叶草和Mac键盘上Commmand键（⌘）的相似之处，由此起了Clover这个名字。四叶草是三叶草的稀有变种。根据西方传统，发现者四叶草意味的是好运，尤其是偶然发现的，更是祥瑞之兆。另外，第一片叶子代表信仰，第二片叶子代表希望，第三片叶子代表爱情，第四片叶子代表运气。——摘自维基百科 Clover是一个操作系统引导程序，可以通过新老两种方式进行启动，也就是BIOS方式和UEFI方式。目前主流的操作系统都已经是通过UEFI方式启动的了，如macOS，Windows 7/8/10 (64-bit)，Linux。 所有的引导都是放在电脑硬盘开头部分的引导区（ESP分区）的EFI文件夹中，Clover也不例外。当然，EFI文件中还存放着Windows，Linux，或者其他操作系统的引导。下面就来看看Clover的文件结构吧。 在Clover下使用UEFI方式启动的流程是这样的：UEFI-&gt;CLOVERX64.efi-&gt;OS。 下面我将主要根据在实际操作中用到的一些功能来介绍Clover。 进入操作系统 这一步非常简单，开机之后用方向键选择你需要进入的操作系统的卷标，按下回车即可。 显示帮助 按下F1键会出现帮助信息。 更新Clover 请在这里下载最新版本的CLOVERX64.efi并使用它替换掉你的EFI文件夹中的Clover文件夹中的同名文件。 开启啰嗦模式启动 首先我要介绍一下什么是啰嗦模式。一般来说，我们在启动系统的时候只能看到一个进度条或者旋转的表示加载中的图案。而啰嗦模式就是将系统启动时各种详细参数和日志以及报错消息全部显示出来的模式，如下图所示。如果发生了操作系统启动异常/失败的情况，通过开启啰嗦模式，我们可以快速定位到出错的位置。 开启啰嗦模式的方法很简单。首先选择你想要进入的系统的图标，按空格即可进入下图所示的页面，然后勾选图示选项，再选择Boot macOS with selected options启动。 显示隐藏的卷标 有的时候在Clover的启动页面中会出现很多以不同方式启动同一系统的卷标（Volume，可以理解为入口），我们可以通过修改Clover的配置文件来隐藏这些卷标，但是有的时候你又需要它们显示出来（比如你要通过进入Recovery卷标来关闭macOS的系统完整性保护的时候）。这个时候我们不必重新修改配置文件，只需要在Clover的主界面按下F3，即可将隐藏的卷标显示出来。 关于怎么隐藏卷标，我将在下面介绍。 提取DSDT DSDT的全称为 Differentiated System Description Table，它是一个描述系统硬件不同信息的表，通过查阅这个表中的信息可以知道你的电脑有什么硬件，它们的名称是什么。知道这些信息有利于我们理顺硬件之间的关系，再通过修改补丁更正硬件信息，以优化操作系统的工作状况。 在Clover主界面下按F4即可将你的DSDT信息保存到EFI/CLOVER/ACPI/origin/文件夹中。请注意，DSDT是由多个文件组成的。 选择你想要启用/禁用的驱动程序 通过Clover加载的驱动程序保存在EFI/CLOVER/kexts/Other中，这些驱动程序是针对macOS生效的。在上面所说的那个文件夹中包含了很多不同的驱动文件，有些驱动文件之间会产生冲突，而有些驱动文件又是完全没有必要存在的。为了管理和精简你的驱动程序，你可以在Clover中设置你想要禁用的驱动程序以排查各种驱动的工作状况。 首先你要选择macOS的图标，按下空格键。然后在新的页面中将光标移动到Block injected kexts，按下回车后进入该选项。再在新的页面中选择Other选项，这个时候你就可以看到你的驱动程序了。勾选你想要禁用的驱动程序以后，按Esc回到主页面，再直接回车进入macOS。 请注意，你的这一设置只对这一次启动有效，在之后的启动中将不会保留。 设置Clover（修改config.plist） 有多种方法进行设置。 你可以在开机以后的Clover主界面下按下按键O进入设置页面，然后你就可以选择不同的选项开始修改你的配置文件了，不过一般情况下我们不会使用这种抽象的方式来修改 使用Clover Configurator来修改 Clover Configurator是一款运行在macOS下的应用程序，专门用来修改Clover的配置文件。它具有友好的图形化界面，每个选项都有比较详细的功能说明，操作起来比在启动时修改要轻松得多。Clover Configurator的下载链接放在文末。 在设置以前，你需要在Clover Configurator的挂载分区选项卡中挂载你ESP分区（通常情况下这个分区都是隐藏的）。然后在你的Clover文件夹下使用Clover Configurator打开config.plist文件，进行修改。修改完成以后，请点击左下角的保存图标（图中以红框标明）。 你还可以使用普通的文本文档编辑器（如Xcode或者Visual Studio Code）打开config.plist对其进行编辑，但是这个方法依旧比较抽象，不推荐新手或者代码小白这样操作 增加/删除/修改/查找驱动程序 在启动以后，你可以使用Clover Configurator挂载EFI分区，然后直接使用访达在驱动文件夹中以可视化的方式管理你的驱动程序。 当然，你也可以使用Disk Genius在Windows下管理你的驱动程序。在下一章节中有关于Disk Genius的更多介绍。 更换Clover的主题 Clover提供了很多自定义功能，你可以选择自己喜欢的Clover开机主题。Clover的主题存放在EFI/CLOVER/themes/文件夹中，你可以下载你喜欢的主题文件夹并将其保存到上述路径中。然后，你需要在Clover Configurator中的引导界面选项卡中填写你想要设置的主题文件夹的名字（如下图）并保存。 作者目前用的是一款名为Simple的主题，可以点击此处下载。在GitHub上还有很多不同的Clover主题可供选择。 隐藏你不需要的卷标 如果你的Clover启动界面有很多引导同一系统的卷标，你可以将他们隐藏起来。具体方法是，Clover Configurator中的引导界面选项卡中的隐藏卷一栏中填写你想要隐藏的卷标的名称，然后保存文件。 Clover的主要功能就介绍到这里了。由于本文是纯粹的新手向，在这里就不介绍如何配置config.plist了。一般来说，只要你能够找到完全对应你机型的EFI文件，基本上就不需要再重新配置Clover了。下面，我们再简单介绍一下新时代的引导工具：OpenCore。 OpenCoreOpenCore是一个着眼于未来的先进的开源引导工具，他支持多种主流操作系统的引导。OC的历史使命就是有朝一日代替Clover，成为主流。OC主要有以下几个优势： 从 2019 年 9 月以后, Acidanthera（神级大佬，黑苹果现有的大部分驱动目前都是他在开发管理）开发的内核驱动 （Lilu, AppleALC 等）将不再会在 Clover 上做兼容性测试（虽然这不能算是优势，但是很关键好吗！） OC的安全性更好，对文件保险箱（FileVault）有更强大的支持 OC使用更先进的方法注入第三方内核驱动（也就是你EFI/CLOVER/kexts/Other里面的那些kext文件） OC在启动体验上会更加接近白苹果 当然，为什么现在OC还未能成为主流，首先是因为它还处于开发阶段，各方面还未达到最成熟的状态；其次是因为OC的配置相对于Clover要复杂许多，而且目前没有像Clover Configurator一样直观的图形化界面的配置工具；最后是因为，OC在社区中普及程度不高，导致遇到问题很难找到现成的案例解决。这些原因使很多人放弃了折腾。但是历史的发展是一个螺旋上升的过程，未来将一定是OC的！（笑） 黑苹果的初步安装讨论完了黑苹果的原理以及核心，下一步就该讲讲如何安装了！但是请大家注意，因为这篇文章主要是面向新手的，所以我只会介绍一些最最基本和通用的操作，目的是为了让大家先把黑苹果装上。而安装完成以后的那些各种优化的操作，包括配置Clover的配置文件，给系统打补丁等定制性比较强的内容，都不会在本文中涉及。博主可能在接下来一段很长的时间内陆陆续续更新一些系统优化的内容，敬请期待！闲话少说，我们开始吧！ 制作安装盘下面的操作均在Windows系统下进行。 在黑果小兵的部落阁按照你的需要下载某个版本的系统镜像文件（后缀为iso） 打开WinMD5软件，将下载完成的iso镜像文件拖入软件窗口，与网站上提供的md5值比对，校验md5值是否正确，如不正确，请重新下载（md5值相当于一个文件的身份证号码，它的值是唯一的，如果你下载下来的文件的md5值与官方提供的不一样，说明你下载的文件可能被修改过或者出错了） 找到一个容量为16GB或以上的空U盘，插入电脑 以管理员身份打开TransMac软件，在窗口中左侧列表鼠标右击你的U盘，点击Restore With Disk Image 点击后有可能会弹出下图所示的警告，是提示你的U盘可能含有已经挂载的卷，请确保你选择的U盘是正确的，然后点击Yes 在弹出的窗口中选择你刚才下载好的iso文件，点击OK，这个时候会格式化你的U盘并把系统镜像烧录到你的U盘中，耐心等待安装盘制作完成吧，这一过程大约要持续20~30分钟 制作完成以后会弹出对话框，直接点击OK 在此之后系统会提示你要格式化U盘，不必理会，直接点击取消 替换安装盘中的EFI文件安装macOS时，我们运行的是在U盘上的macOS安装程序，这一步与运行macOS其实是差不多的。此时我们的U盘就相当于一个外置的系统盘，需要通过位于U盘上的Clover引导来启动macOS安装程序。 为了可以正确引导操作系统，不同型号，甚至不同批次的电脑的EFI文件都是不太一样的。因为这些电脑之间的硬件有所区别，所以你需要确保你的电脑的EFI文件是与你的电脑硬件适配的。这个问题的原理我们已经在前面提到过了。 但是这个软硬件适配的工作对于小白来说极度不友好，因为这需要一部分的数字电路，微型计算机原理，以及代码编写的知识。那有什么办法可以解决这个问题呢？答案就是：“拿来主义”。多亏了开源社区的发展，有许多人在网站上将他们已经完善的EFI文件分享给其他使用同一型号电脑的人。所以你现在要做的就是：找到与你的电脑型号对应的EFI文件，然后下载下来。 daliansky整理了一个清单，里面收集了大量不同机型的EFI文件，你可以在里面找找有没有自己电脑的型号：Hackintosh黑苹果长期维护机型整理清单。如果有的话，点击链接，然后将别人提供的这个EFI文件下载下来即可。 这时有人会问了，如果没找到自己电脑的型号怎么办呢？不要气馁，你也可以尝试使用与你的电脑硬件配置类似的其他机型的EFI文件，或者使用daliansky提供的镜像中的通用EFI文件。 按照daliansky的建议，在安装macOS时不必将镜像中的通用EFI文件替换为对应自己机型的EFI文件。但是我个人认为，如果你已经找到了与你的机型对应的EFI文件，那么在安装之前就将其更换，可能会在安装过程中避免一些错误的发生。 下面就来介绍一下如何替换安装盘中的EFI文件吧！ 打开DiskGenius软件，在左侧列表中找到你已经制作好的安装盘，并单击选中 依次双击右侧列表中的ESP(0)卷标，EFI文件夹，进入如下页面 单击CLOVER文件夹，然后按delete键，弹出对话框后点击删除，将这个文件夹删除掉 选中你从别人那儿拿来的EFI文件中的CLOVER文件夹，按下Ctrl+C后将窗口切回DiskGenius，然后再按下Ctrl+V将新的CLOVER文件夹复制进去，这样就完成了EFI文件的替换了 给硬盘分区接下来我们要在电脑的硬盘上给即将安装的macOS分配一块足够大的空间。 以下操作均在Windows下的DiskGenius软件中进行，且以我的U盘作为示例，操作方法与在电脑内置硬盘上的一样。在进行以下操作之前，请先备份你的文件。 打开DiskGenius软件，在右侧列表中选中你的硬盘，然后在顶部查看你的硬盘空间分配情况，在顶部最左侧找到你的EFI分区，确保你的EFI分区的空间大于200MB，否则macOS将无法安装 右键单击你的硬盘，选择转换分区表类型为GUID模式，否则macOS将无法安装，如果这个选项是灰色的而下一个选项可选，则无须转换 右键单击上方的蓝色容量条，点击建立新分区 在弹出的窗口中调整你要分给macOS的容量大小，然后点击开始，接下来会有弹窗出现，请严格遵守弹窗中给出的要求操作，以免发生意外，然后点击是，开始分区 分区完成以后，右键单击顶部蓝色容量条，点击删除当前分区（因为macOS的磁盘格式为APFS，因此现在对其进行格式化没有意义） 设置BIOS前文已经说过，操作系统的启动顺序是UEFI/BIOS-&gt;CLOVERX64.efi-&gt;OS。因此，为了使我们的电脑可以启动安装盘上的macOS安装程序，我们还需要正确设置我们的BIOS。 由于不同品牌的电脑使用不同的主板，所以BIOS的设置以及进行操作的键位也千差万别，这里仅以作者的电脑举例。由于作者电脑的BIOS十分垃圾，可供调整的选项寥寥无几，因此下面所给出的操作步骤中的设置配置要求是最基本的。如果你的电脑的BIOS功能足够强大且有很多其他的设置选项的话，请尽量弄懂这些选项的含义，并按照需要进行设置。 按下开机按钮以后，迅速按F10进入BIOS设置 按方向键进入系统设置菜单中的启动选项，请开启传统模式，禁用安全启动模式，启用USB启动 按F10保存设置，电脑将自动重启 现在BIOS也已经设置完成。做完这些前期准备工作以后，接下来就要正式开始安装系统了！ 安装系统下面以macOS 10.15.3的安装过程为例。 重启电脑，看到左下角的提示以后，按esc暂停启动 进入启动菜单，按F9进入启动设备选项 在列出的一串引导中，选择USB硬盘（UEFI）的选项以启动安装盘中的引导，如果你使用的是daliansky提供的较新的系统镜像，安装盘中会出现两个引导，一个是微PE（后面会提到），另一个是Clover，我们需要启动的是Clover 进入Clover界面以后，按照前文所说过的方法，开启啰嗦模式 如果你需要使用镜像中的通用EFI文件，那么请执行下面的步骤，否则直接跳过： 在Clover主界面按O进入选项，光标移动到Configs后按回车进入进入该选项，这个选项是用来选择需要生效的Clover配置文件的 选择config_Install这个配置文件 按两次esc返回到Clover主界面 在Clover主界面选择卷标Boot macOS Install from Install macOS Catalina，然后按下回车，开始引导安装程序 这个时候会出现如下图所示的安装日志，如果你很不幸地卡住了，那么你可以参考macOS Catalina 10.15安装中常见的问题及解决方法，或者附上你卡住的地方的照片和你的电脑配置，在各种交 流 群中询问大佬 如果没有卡住，你的日志会消失，然后出现苹果的logo和进度条 等待一段时间以后，会出现语言选择界面，请选择中文并点击继续，如果有装逼需求或者想练习外语，你也可以选择其他语言 选择磁盘工具并点击继续 进入磁盘工具以后，在左上角右键点击你的磁盘，并选择显示所有设备，并找到你之前已经准备好安装macOS的分区 选中你之前已经准备好安装macOS的分区，然后点击抹掉，在弹出的窗口中，你需要给你的分区起一个名字，并将格式设置成APFS，然后将方案设置为GUID分区图，再点击抹掉，这一步会将你电脑上的硬盘分区格式化 操作完成以后，点击左上方磁盘工具，在弹出的选项中选择退出磁盘工具并返回到安装界面 在主界面选择安装macOS并点击继续，再闭着眼睛同意条款 在下图所示的界面中选择你要安装的磁盘分区，然后点击安装，接下来安装程序会将安装文件复制到你的分区中，这个过程会持续几分钟，待复制完成以后，电脑会重新启动 重启之后，按照本节一开始所述方法进入Clover，这时候你会发现，Clover主界面会多出来几个卷标，从现在开始直到安装完成，请都选择Boot macOS Install form xxx（你给你的macOS分区起的名字）卷标启动，在安装过程中请耐心等待，无论你做了什么奇怪的事情让你增加了什么奇怪的知识，都不要在出现白苹果logo的时候乱动鼠标或者键盘 经过两到三次重启以后，你会发现Boot macOS Install form xxx的卷标消失了，新出现了Boot macOS form xxx的卷标，选中它，然后进入，再对着白苹果等待几分钟，难得的休息时间马上就要结束了 进度条走完，出现设置向导，接下来会让你设置你的国家和地区，语言和输入法，按照你的需要设置即可，然后会进入数据和隐私界面，点击继续 接下来会问你是否需要将macOS从你的备份中恢复，黑苹果玩家一无所有，选择现在不传输任何信息并点击继续 接下来要你使用Apple ID登陆，这里先跳过 还是闭着眼接受条款 接下来你需要创建一个电脑用户，这是一个管理员帐户，请注意，在这里设置了用户名以后，如果未来要更改的话会极为麻烦，建议想清楚了再继续下一步 进入快捷设置页面，点击继续，然后会进入分析页面，取消勾选与App开发共享崩溃与使用数据，黑苹果这种东西自己偷摸着用就行 接下来还会要你设置屏幕使用时间，Siri，以及外观，这些选项按照你的需要设置就行，一路继续下去，直到出现正在设置你的Mac页面，请稍等片刻 终于进入了桌面，这时macOS的基本安装已经完成了！先庆祝一下，折腾的事情还在后头呢（虽然这篇文章不会写吧……） 将引导添加到硬盘并调整顺序现在，macOS已经成功安装到我们电脑的硬盘上了，但是我们电脑硬盘上的macOS还是通过U盘里的Clover引导的。这就意味着，如果拔掉U盘，我们将不能够启动macOS。所以我们需要将U盘引导区中的Clover文件夹复制到硬盘引导区的EFI文件夹中，以实现脱离U盘启动。这一步的操作与前文替换安装盘中的EFI文件这一小节的操作基本是一致的，需要你在Windows系统下使用DiskGenius操作，这里就不再赘述了。 如果现在重启电脑，你还是会发现直接进入了Windows的引导而不是Clover。这是因为除了Clover之外，电脑当然还有许多其他的引导项，这些引导项按顺序排列在启动序列之中。现在我们只是把Clover的文件夹放入了硬盘的引导区中，但是还没有把Clover添加到启动序列之中。电脑不知道自己居然还可以用Clover引导macOS，只能继续用老一套方法直接引导Windows启动了。那么下面我们就要告诉电脑，让它知道自己可以使用Clover引导操作系统。下面的操作都是在Windows下进行的。 打开EasyUEFI软件，你可以看到所有的引导项之中没有Clover，点击红框中按钮创建新的引导项 在弹出的窗口中，类型选择Linux或者其它操作系统，描述可以随便填写，这里使用的是CLOVER，目标分区选择磁盘0的ESP分区（唯一可选的那一个） 在文件路径一行中，点击浏览，在弹出的窗口中显示了一个硬盘的图标，这个就是你电脑上硬盘的ESP分区了，点击它左侧的加号将其展开，在EFI文件夹中找到CLOVERX64.efi，这个就是Clover的引导文件，选中后点击确定 回到原先的界面之后，点击确定，可以发现Clover已经添加到启动序列中了 到这里还没结束，因为Clover被上面众多引导项压着，启动的时候怎么也轮不到它，因此我们点击红框中的按钮，将Clover移到启动序列的第一位，使电脑开机的时候默认使用Clover引导操作系统 现在再重启电脑，不要按esc暂停启动，电脑会默认使用Clover进行引导。选择macOS分卷，按回车进入。如果成功启动了，那么你便可以重新设置你的BIOS，将传统模式关闭了（但不要开启安全启动模式）。 到这里，macOS的前期安装已经正式完成！夸赞一波自己吧！ 黑苹果单系统安装按照上面所说的步骤，如果不出问题，你便在电脑上成功安装了Windows和macOS双系统。如果你只需要macOS的单系统，操作步骤与上面所说有些许不同，但是绝大部分步骤是一样的，唯一的区别在于给磁盘分区和将引导添加到硬盘并调整顺序这两部步。如果你在制作安装盘的时候，下载的是daliansky提供的较新系统版本的镜像，或者你在制作完系统启动U盘以后，在此电脑中可以看到有诸如微PE字样的磁盘，那么下面步骤中的前三步可以省略掉。大致的操作方法如下： 于官网下载微PE工具箱V2.0 64位版本 打开软件，将微PE工具安装到你的已经制作好的macOS安装盘中 将DiskGenius和UEFIManager拷贝到微PE的文件盘中（微PE系统中本身自带非专业版的DiskGenius，某些功能有缺失） 设置BIOS 重启，在BIOS中使用安装盘中微PE的引导启动 进入系统后你可以发现界面与Windows10几乎一样，运行你存放在U盘中的DiskGenius，删除你硬盘中Windows使用的分区，并删除硬盘EFI分区的Windows文件夹 将硬盘分区表类型转换为GUID格式 按照你的需要以及前文所述要求，重新分配你的硬盘分区，并将他们格式化 接下来就是安装系统了，如果一切顺利进入了macOS的桌面，你可以继续下面的步骤 重启，使用安装盘中微PE的引导启动 运行DiskGenius，将安装盘EFI文件夹中CLOVER文件夹复制到电脑硬盘的EFI文件夹中 运行UEFIManager，然后参考上文所说的方法，添加并调整你的引导项 如果没有问题，关闭BIOS的传统模式启动 大功告成！ 安装完成后可能出现的问题完成macOS的安装并不代表你的电脑就已经是可堪重用的生产力/娱乐工具了。绝大多数情况下，刚刚完成安装的黑苹果还会存在着各种各样的问题。即使你使用的是完全对应你的电脑型号的EFI文件，依然有大概率会出现这些问题。黑苹果的折腾之处不是安装macOS的过程，而是完全解决这些问题的过程。所以这就是为什么我建议大家不要在安装的最后几步（包括完成安装以后）登陆你的苹果服务，因为你的电脑存在的一些问题会导致苹果服务登不上去，而且折腾的过程也有可能把你的Apple ID中的信息搞乱，就像下图一样。 安装完成以后，大家可以检查一下自己的电脑有没有出现下面列出的这些问题。下面的检查大部分都在macOS的设置中完成，还有一些直接观察即可。在每个问题的末尾都会给大家提供一些解决问题的思考方向，但并不会提供具体的解决办法。另外还附上了无故障发生的效果图供大家参考。 网络与蓝牙的问题：下面的这些问题与你的网卡的型号或者驱动有关 打开系统偏好设置-网络选项，里面没有有Wi-Fi选项，即使有也打不开Wi-Fi 打开系统偏好设置-蓝牙选项，无法开启蓝牙 无法使用随航 无法使用Siri，FaceTime，iMessage 声音的问题：这个问题的表现形式很多，出现这些问题是因为声卡没有驱动 打开系统系统偏好设置-声音选项，无法调节音量 勾选当更改音量时播放反馈再调节音量，电脑没有声音 麦克风没有输入电平的变化 使用快捷键调节音量，喇叭图标下出现禁行标志 触控板的问题：触控板根本没有反应，或者在系统偏好设置-触控板选项中某些手势无法使用，或者某些功能不显示，这个问题与你的触控板驱动有关 显示的问题：这个问题也涉及到很多方面，注意下面给出的图片是错误示例，不是正确的打开方式 色偏严重：这个问题与你的显示器描述文件和EDID有关 文字显示过小，图标与文字比例失调：这个问题与你的EDID以及是否开启了HiDPI有关 出现颜色断层：这个问题与你的EDID和显卡缓冲帧有关 无法调节亮度：在系统偏好设置-显示器选项中没有亮度调节条，键盘上的亮度调节快捷键也没有反应，这个问题可能与你的亮度调节驱动或者系统补丁有关 电源管理的问题：这个问题的表现形式很多，导致这个问题产生的原因也很多 节能管理未加载：在系统偏好设置-节能选项中没有将4个（台式机为5个）选项全部加载，出现这个问题是因为你没有加载macOS原生的电源管理 睡眠失灵：睡眠秒醒或者睡眠自动关机/死机/重启，这个问题与你的电源管理或者USB驱动有关 USB总线的问题：USB接口部分或者全部失灵，打开Photo Booth后摄像头无画面，这个问题与你的USB驱动有关（话说回来Photo Booth还是蛮有意思的😂） 独立显卡无法驱动：黑苹果下只有部分独立显卡可以驱动，如果你的独显有独立输出并且满足特定型号要求的话可以尝试将其驱动，否则你就需要屏蔽独显，使用集显了，这里不展开叙述 另外，你也可以在左上角苹果图标-关于本机-系统报告中直接查看你电脑的硬件情况。通过检查各个硬件的驱动情况和相关数据，一样可以判断你的电脑是否会有上面的问题。 上面给大家介绍的都是一些典型的问题，你也有可能遇到其他的疑难杂症。希望大家面对问题不要望而却步，尽情享受折腾的过程吧！ (～￣▽￣)～ 黑苹果相关资源推荐折腾黑苹果，宜广集信息，多多提问；忌盲目瞎搞，重复建设。 黑苹果相关优秀网站 黑果小兵的部落阁：也就是daliansky——国内黑苹果领军人物的博客，他的网站会非常及时地更新系统镜像并不定时地提供一些精品教程 IT密码：网站上面的资源非常丰富，从系统镜像到软件资源再到方法技巧一应俱全，博主也是非常牛啤的 OC简体中文参考手册：由业界大佬合力完成，仍在维护中，学习OC必备 GitHub：这个不用多说了，绝大部分黑苹果软件和驱动的来源，全球最大同性交友网站🐶，神奇的地方 远景论坛：国内最主要的黑苹果交流论坛，注册需要邀请码 tonymacx86：国外知名的黑苹果交流论坛，资源丰富，需要一定的英语能力 insanelymac：与tonymacx86类似的论坛 黑苹果软件、驱动资源下面只列出了一些至关重要的驱动和软件，其他功能的还有很多，这里就不一一列出了。 Clover Configurator：Clover的图形化配置软件 Hackintool：黑苹果完善必备工具 Clover：在这里可以找到已经编译好的Clover Lilu.kext：众多常用驱动的依赖 AppleALC.kext：常用声卡驱动 VoodooPS2Controller.kext：PS2总线输入设备（鼠标，键盘，触控板）的驱动，此外对于I2C总线的输入设备还有VoodooI2C.kext VoodooInput.kext：VoodooPS2Controller的依赖 WhateverGreen.kext：用于驱动Intel集成显卡 FakeSMC.kext：必备驱动，用于仿冒SMC设备，欺骗macOS，让它以为我们的电脑就是Mac 声明与致谢黑苹果社区的健康需要大家共同维护，恳请新人们注意以下几点： 不要把社区的成果（如各种机型的EFI，开源软件等）拿来作商业用途 不要购买淘宝上面的EFI！所有现存的EFI都可以在网上免费获得！请不要支持那些兜售EFI的无良商家，他们也是从网上下载的 不建议去淘宝上购买安装黑苹果的服务，出了问题到最后还是要你自己解决 不建议把自己的折腾成果在网络上有偿提供，这样并不利于社区的发展 网友没有义务去无偿地帮你解决问题，另外也请善用搜索引擎 黑苹果一开始是极客的产物，是反叛精神的象征。令人意料不到的是，现在它居然可以为我们普通人所用。而从极客到大众的过渡，黑苹果的开源社区对此作出了极大贡献。对那些对社区做出过极大贡献的极客和工程师们，对社区建设贡献出自己的一份力量、努力维护社区健康发展的成员，我向你们表达最诚挚的感谢。没有社区，就没有黑苹果的今天。作为从社区中获益的普通成员，也应该通过自己的努力，以自己的方式去回馈这个社区，帮助它更好地发展。 博主在此谨向你们表达我的感谢：RehabMan，Acidanthera，黑果小兵，SlientSliver，IT密码，以及其他给予过我帮助的网友或开发者们😘。 附：软件度盘链接 ，密码：3lkx。 📌 Note 在这篇文章写成之后不久，Apple推出了M1芯片以及macOS Big Sur。这对黑苹果来说无疑是一个重大打击。虽然macOS肯定还会对使用Intel CPU的电脑继续提供几年的支持，但是如果苹果未来不再推出使用Intel CPU的电脑，那么黑苹果的未来恐怕不容乐观。另外，黑苹果社区也出现了比较大的变化。随着更先进更安全更简单的Open Core逐渐成熟，其使用者也越来越多。虽然Clover仍然保留了对最新的macOS的支持，但是其已然落后。这也就是说，在这篇文章写完之后，其内容已经过时了（悲，但如果是安装Big Sur以下版本的macOS，这篇文章还是有一定的指导意义的）。最后，出于时间和精力的考虑，博主已经不打算再折腾黑苹果了。感谢黑苹果这两年来的陪伴。","link":"/2020/02/14/Introduction_to_hackintosh/"}],"tags":[{"name":"Astrobear","slug":"Astrobear","link":"/tags/Astrobear/"},{"name":"Life","slug":"Life","link":"/tags/Life/"},{"name":"Others","slug":"Others","link":"/tags/Others/"},{"name":"Photos","slug":"Photos","link":"/tags/Photos/"},{"name":"Astrophotography","slug":"Astrophotography","link":"/tags/Astrophotography/"},{"name":"AirSim","slug":"AirSim","link":"/tags/AirSim/"},{"name":"Research","slug":"Research","link":"/tags/Research/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"Programming Language","slug":"Programming-Language","link":"/tags/Programming-Language/"},{"name":"RL","slug":"RL","link":"/tags/RL/"},{"name":"Windows 10","slug":"Windows-10","link":"/tags/Windows-10/"},{"name":"ROG","slug":"ROG","link":"/tags/ROG/"},{"name":"macOS","slug":"macOS","link":"/tags/macOS/"},{"name":"Hackintosh","slug":"Hackintosh","link":"/tags/Hackintosh/"},{"name":"HP","slug":"HP","link":"/tags/HP/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"Travis CI","slug":"Travis-CI","link":"/tags/Travis-CI/"},{"name":"Blog","slug":"Blog","link":"/tags/Blog/"},{"name":"Nginx","slug":"Nginx","link":"/tags/Nginx/"},{"name":"Server","slug":"Server","link":"/tags/Server/"}],"categories":[{"name":"Others","slug":"Others","link":"/categories/Others/"},{"name":"CS","slug":"CS","link":"/categories/CS/"},{"name":"Hackintosh","slug":"Hackintosh","link":"/categories/Hackintosh/"}]}